Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x1340 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 24 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x109ee5): GNU C11 12.3.1 20230626 -mcpu=cortex-m33 -mfpu=fpv5-sp-d16 -mfloat-abi=hard -mthumb -march=armv8-m.main+dsp+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x14b417): ../Core/Src/adc.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x1053c8): C:/Users/ethan/STM32CubeIDE/workspace_1.17.0/SchoolZoneAlert_Final/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 5 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0xe275c): signed char
 <1><31>: Abbrev Number: 5 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 1
    <33>   DW_AT_encoding    : 8	(unsigned char)
    <34>   DW_AT_name        : (indirect string, offset: 0x80b07): unsigned char
 <1><38>: Abbrev Number: 5 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 2
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x8ce45): short int
 <1><3f>: Abbrev Number: 3 (DW_TAG_typedef)
    <40>   DW_AT_name        : (indirect string, offset: 0x9bef9): __uint16_t
    <44>   DW_AT_decl_file   : 2
    <45>   DW_AT_decl_line   : 57
    <46>   DW_AT_decl_column : 25
    <47>   DW_AT_type        : <0x4b>
 <1><4b>: Abbrev Number: 5 (DW_TAG_base_type)
    <4c>   DW_AT_byte_size   : 2
    <4d>   DW_AT_encoding    : 7	(unsigned)
    <4e>   DW_AT_name        : (indirect string, offset: 0x611a7): short unsigned int
 <1><52>: Abbrev Number: 5 (DW_TAG_base_type)
    <53>   DW_AT_byte_size   : 4
    <54>   DW_AT_encoding    : 5	(signed)
    <55>   DW_AT_name        : (indirect string, offset: 0x124315): long int
 <1><59>: Abbrev Number: 3 (DW_TAG_typedef)
    <5a>   DW_AT_name        : (indirect string, offset: 0x12336): __uint32_t
    <5e>   DW_AT_decl_file   : 2
    <5f>   DW_AT_decl_line   : 79
    <60>   DW_AT_decl_column : 25
    <61>   DW_AT_type        : <0x65>
 <1><65>: Abbrev Number: 5 (DW_TAG_base_type)
    <66>   DW_AT_byte_size   : 4
    <67>   DW_AT_encoding    : 7	(unsigned)
    <68>   DW_AT_name        : (indirect string, offset: 0xd80e2): long unsigned int
 <1><6c>: Abbrev Number: 5 (DW_TAG_base_type)
    <6d>   DW_AT_byte_size   : 8
    <6e>   DW_AT_encoding    : 5	(signed)
    <6f>   DW_AT_name        : (indirect string, offset: 0x9b3f): long long int
 <1><73>: Abbrev Number: 3 (DW_TAG_typedef)
    <74>   DW_AT_name        : (indirect string, offset: 0x11b006): __uint64_t
    <78>   DW_AT_decl_file   : 2
    <79>   DW_AT_decl_line   : 105
    <7a>   DW_AT_decl_column : 25
    <7b>   DW_AT_type        : <0x7f>
 <1><7f>: Abbrev Number: 5 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0xad296): long long unsigned int
 <1><86>: Abbrev Number: 25 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 5 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0x9bfbe): unsigned int
 <1><94>: Abbrev Number: 3 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x9befb): uint16_t
    <99>   DW_AT_decl_file   : 3
    <9a>   DW_AT_decl_line   : 36
    <9b>   DW_AT_decl_column : 20
    <9c>   DW_AT_type        : <0x3f>
 <1><a0>: Abbrev Number: 3 (DW_TAG_typedef)
    <a1>   DW_AT_name        : (indirect string, offset: 0x12338): uint32_t
    <a5>   DW_AT_decl_file   : 3
    <a6>   DW_AT_decl_line   : 48
    <a7>   DW_AT_decl_column : 20
    <a8>   DW_AT_type        : <0x59>
 <1><ac>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <ad>   DW_AT_type        : <0xa0>
 <1><b1>: Abbrev Number: 3 (DW_TAG_typedef)
    <b2>   DW_AT_name        : (indirect string, offset: 0x11b008): uint64_t
    <b6>   DW_AT_decl_file   : 3
    <b7>   DW_AT_decl_line   : 60
    <b8>   DW_AT_decl_column : 20
    <b9>   DW_AT_type        : <0x73>
 <1><bd>: Abbrev Number: 10 (DW_TAG_array_type)
    <be>   DW_AT_type        : <0xa0>
    <c2>   DW_AT_sibling     : <0xcd>
 <2><c6>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <c7>   DW_AT_type        : <0x8d>
    <cb>   DW_AT_upper_bound : 3
 <2><cc>: Abbrev Number: 0
 <1><cd>: Abbrev Number: 10 (DW_TAG_array_type)
    <ce>   DW_AT_type        : <0xa0>
    <d2>   DW_AT_sibling     : <0xdd>
 <2><d6>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <d7>   DW_AT_type        : <0x8d>
    <db>   DW_AT_upper_bound : 1
 <2><dc>: Abbrev Number: 0
 <1><dd>: Abbrev Number: 10 (DW_TAG_array_type)
    <de>   DW_AT_type        : <0xa0>
    <e2>   DW_AT_sibling     : <0xed>
 <2><e6>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <e7>   DW_AT_type        : <0x8d>
    <eb>   DW_AT_upper_bound : 7
 <2><ec>: Abbrev Number: 0
 <1><ed>: Abbrev Number: 10 (DW_TAG_array_type)
    <ee>   DW_AT_type        : <0xac>
    <f2>   DW_AT_sibling     : <0xfd>
 <2><f6>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <f7>   DW_AT_type        : <0x8d>
    <fb>   DW_AT_upper_bound : 1
 <2><fc>: Abbrev Number: 0
 <1><fd>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <fe>   DW_AT_type        : <0xed>
 <1><102>: Abbrev Number: 13 (DW_TAG_structure_type)
    <103>   DW_AT_byte_size   : 128
    <104>   DW_AT_decl_file   : 4
    <105>   DW_AT_decl_line   : 402
    <107>   DW_AT_decl_column : 9
    <107>   DW_AT_sibling     : <0x1da>
 <2><10b>: Abbrev Number: 1 (DW_TAG_member)
    <10c>   DW_AT_name        : (indirect string, offset: 0xbd367): CLBAR
    <110>   DW_AT_decl_file   : 4
    <111>   DW_AT_decl_line   : 404
    <113>   DW_AT_decl_column : 17
    <114>   DW_AT_type        : <0xac>
    <118>   DW_AT_data_member_location: 0
 <2><119>: Abbrev Number: 1 (DW_TAG_member)
    <11a>   DW_AT_name        : (indirect string, offset: 0x66e28): RESERVED1
    <11e>   DW_AT_decl_file   : 4
    <11f>   DW_AT_decl_line   : 405
    <121>   DW_AT_decl_column : 17
    <122>   DW_AT_type        : <0xcd>
    <126>   DW_AT_data_member_location: 4
 <2><127>: Abbrev Number: 1 (DW_TAG_member)
    <128>   DW_AT_name        : (indirect string, offset: 0x1239dd): CFCR
    <12c>   DW_AT_decl_file   : 4
    <12d>   DW_AT_decl_line   : 406
    <12f>   DW_AT_decl_column : 17
    <130>   DW_AT_type        : <0xac>
    <134>   DW_AT_data_member_location: 12
 <2><135>: Abbrev Number: 6 (DW_TAG_member)
    <136>   DW_AT_name        : CSR
    <13a>   DW_AT_decl_file   : 4
    <13a>   DW_AT_decl_line   : 407
    <13c>   DW_AT_decl_column : 17
    <13c>   DW_AT_type        : <0xac>
    <140>   DW_AT_data_member_location: 16
 <2><141>: Abbrev Number: 6 (DW_TAG_member)
    <142>   DW_AT_name        : CCR
    <146>   DW_AT_decl_file   : 4
    <146>   DW_AT_decl_line   : 408
    <148>   DW_AT_decl_column : 17
    <148>   DW_AT_type        : <0xac>
    <14c>   DW_AT_data_member_location: 20
 <2><14d>: Abbrev Number: 1 (DW_TAG_member)
    <14e>   DW_AT_name        : (indirect string, offset: 0x66e32): RESERVED2
    <152>   DW_AT_decl_file   : 4
    <153>   DW_AT_decl_line   : 409
    <155>   DW_AT_decl_column : 17
    <156>   DW_AT_type        : <0x1da>
    <15a>   DW_AT_data_member_location: 24
 <2><15b>: Abbrev Number: 1 (DW_TAG_member)
    <15c>   DW_AT_name        : (indirect string, offset: 0x11a907): CTR1
    <160>   DW_AT_decl_file   : 4
    <161>   DW_AT_decl_line   : 410
    <163>   DW_AT_decl_column : 17
    <164>   DW_AT_type        : <0xac>
    <168>   DW_AT_data_member_location: 64
 <2><169>: Abbrev Number: 1 (DW_TAG_member)
    <16a>   DW_AT_name        : (indirect string, offset: 0xde4f1): CTR2
    <16e>   DW_AT_decl_file   : 4
    <16f>   DW_AT_decl_line   : 411
    <171>   DW_AT_decl_column : 17
    <172>   DW_AT_type        : <0xac>
    <176>   DW_AT_data_member_location: 68
 <2><177>: Abbrev Number: 1 (DW_TAG_member)
    <178>   DW_AT_name        : (indirect string, offset: 0xcac9c): CBR1
    <17c>   DW_AT_decl_file   : 4
    <17d>   DW_AT_decl_line   : 412
    <17f>   DW_AT_decl_column : 17
    <180>   DW_AT_type        : <0xac>
    <184>   DW_AT_data_member_location: 72
 <2><185>: Abbrev Number: 1 (DW_TAG_member)
    <186>   DW_AT_name        : (indirect string, offset: 0xfda7e): CSAR
    <18a>   DW_AT_decl_file   : 4
    <18b>   DW_AT_decl_line   : 413
    <18d>   DW_AT_decl_column : 17
    <18e>   DW_AT_type        : <0xac>
    <192>   DW_AT_data_member_location: 76
 <2><193>: Abbrev Number: 1 (DW_TAG_member)
    <194>   DW_AT_name        : (indirect string, offset: 0xf43aa): CDAR
    <198>   DW_AT_decl_file   : 4
    <199>   DW_AT_decl_line   : 414
    <19b>   DW_AT_decl_column : 17
    <19c>   DW_AT_type        : <0xac>
    <1a0>   DW_AT_data_member_location: 80
 <2><1a1>: Abbrev Number: 1 (DW_TAG_member)
    <1a2>   DW_AT_name        : (indirect string, offset: 0x11a93b): CTR3
    <1a6>   DW_AT_decl_file   : 4
    <1a7>   DW_AT_decl_line   : 415
    <1a9>   DW_AT_decl_column : 17
    <1aa>   DW_AT_type        : <0xac>
    <1ae>   DW_AT_data_member_location: 84
 <2><1af>: Abbrev Number: 1 (DW_TAG_member)
    <1b0>   DW_AT_name        : (indirect string, offset: 0xcaca1): CBR2
    <1b4>   DW_AT_decl_file   : 4
    <1b5>   DW_AT_decl_line   : 416
    <1b7>   DW_AT_decl_column : 17
    <1b8>   DW_AT_type        : <0xac>
    <1bc>   DW_AT_data_member_location: 88
 <2><1bd>: Abbrev Number: 1 (DW_TAG_member)
    <1be>   DW_AT_name        : (indirect string, offset: 0x66e3c): RESERVED3
    <1c2>   DW_AT_decl_file   : 4
    <1c3>   DW_AT_decl_line   : 417
    <1c5>   DW_AT_decl_column : 17
    <1c6>   DW_AT_type        : <0xdd>
    <1ca>   DW_AT_data_member_location: 92
 <2><1cb>: Abbrev Number: 1 (DW_TAG_member)
    <1cc>   DW_AT_name        : (indirect string, offset: 0x15dc4c): CLLR
    <1d0>   DW_AT_decl_file   : 4
    <1d1>   DW_AT_decl_line   : 418
    <1d3>   DW_AT_decl_column : 17
    <1d4>   DW_AT_type        : <0xac>
    <1d8>   DW_AT_data_member_location: 124
 <2><1d9>: Abbrev Number: 0
 <1><1da>: Abbrev Number: 10 (DW_TAG_array_type)
    <1db>   DW_AT_type        : <0xa0>
    <1df>   DW_AT_sibling     : <0x1ea>
 <2><1e3>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <1e4>   DW_AT_type        : <0x8d>
    <1e8>   DW_AT_upper_bound : 9
 <2><1e9>: Abbrev Number: 0
 <1><1ea>: Abbrev Number: 9 (DW_TAG_typedef)
    <1eb>   DW_AT_name        : (indirect string, offset: 0x27f86): DMA_Channel_TypeDef
    <1ef>   DW_AT_decl_file   : 4
    <1f0>   DW_AT_decl_line   : 419
    <1f2>   DW_AT_decl_column : 3
    <1f2>   DW_AT_type        : <0x102>
 <1><1f6>: Abbrev Number: 10 (DW_TAG_array_type)
    <1f7>   DW_AT_type        : <0xa0>
    <1fb>   DW_AT_sibling     : <0x206>
 <2><1ff>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <200>   DW_AT_type        : <0x8d>
    <204>   DW_AT_upper_bound : 2
 <2><205>: Abbrev Number: 0
 <1><206>: Abbrev Number: 13 (DW_TAG_structure_type)
    <207>   DW_AT_byte_size   : 52
    <208>   DW_AT_decl_file   : 4
    <209>   DW_AT_decl_line   : 549
    <20b>   DW_AT_decl_column : 9
    <20b>   DW_AT_sibling     : <0x2b0>
 <2><20f>: Abbrev Number: 1 (DW_TAG_member)
    <210>   DW_AT_name        : (indirect string, offset: 0x13bd98): MODER
    <214>   DW_AT_decl_file   : 4
    <215>   DW_AT_decl_line   : 551
    <217>   DW_AT_decl_column : 17
    <218>   DW_AT_type        : <0xac>
    <21c>   DW_AT_data_member_location: 0
 <2><21d>: Abbrev Number: 1 (DW_TAG_member)
    <21e>   DW_AT_name        : (indirect string, offset: 0x129c88): OTYPER
    <222>   DW_AT_decl_file   : 4
    <223>   DW_AT_decl_line   : 552
    <225>   DW_AT_decl_column : 17
    <226>   DW_AT_type        : <0xac>
    <22a>   DW_AT_data_member_location: 4
 <2><22b>: Abbrev Number: 1 (DW_TAG_member)
    <22c>   DW_AT_name        : (indirect string, offset: 0xf8814): OSPEEDR
    <230>   DW_AT_decl_file   : 4
    <231>   DW_AT_decl_line   : 553
    <233>   DW_AT_decl_column : 17
    <234>   DW_AT_type        : <0xac>
    <238>   DW_AT_data_member_location: 8
 <2><239>: Abbrev Number: 1 (DW_TAG_member)
    <23a>   DW_AT_name        : (indirect string, offset: 0x141e6e): PUPDR
    <23e>   DW_AT_decl_file   : 4
    <23f>   DW_AT_decl_line   : 554
    <241>   DW_AT_decl_column : 17
    <242>   DW_AT_type        : <0xac>
    <246>   DW_AT_data_member_location: 12
 <2><247>: Abbrev Number: 6 (DW_TAG_member)
    <248>   DW_AT_name        : IDR
    <24c>   DW_AT_decl_file   : 4
    <24c>   DW_AT_decl_line   : 555
    <24e>   DW_AT_decl_column : 17
    <24e>   DW_AT_type        : <0xac>
    <252>   DW_AT_data_member_location: 16
 <2><253>: Abbrev Number: 6 (DW_TAG_member)
    <254>   DW_AT_name        : ODR
    <258>   DW_AT_decl_file   : 4
    <258>   DW_AT_decl_line   : 556
    <25a>   DW_AT_decl_column : 17
    <25a>   DW_AT_type        : <0xac>
    <25e>   DW_AT_data_member_location: 20
 <2><25f>: Abbrev Number: 1 (DW_TAG_member)
    <260>   DW_AT_name        : (indirect string, offset: 0x39ce7): BSRR
    <264>   DW_AT_decl_file   : 4
    <265>   DW_AT_decl_line   : 557
    <267>   DW_AT_decl_column : 17
    <268>   DW_AT_type        : <0xac>
    <26c>   DW_AT_data_member_location: 24
 <2><26d>: Abbrev Number: 1 (DW_TAG_member)
    <26e>   DW_AT_name        : (indirect string, offset: 0x15c11a): LCKR
    <272>   DW_AT_decl_file   : 4
    <273>   DW_AT_decl_line   : 558
    <275>   DW_AT_decl_column : 17
    <276>   DW_AT_type        : <0xac>
    <27a>   DW_AT_data_member_location: 28
 <2><27b>: Abbrev Number: 6 (DW_TAG_member)
    <27c>   DW_AT_name        : AFR
    <280>   DW_AT_decl_file   : 4
    <280>   DW_AT_decl_line   : 559
    <282>   DW_AT_decl_column : 17
    <282>   DW_AT_type        : <0xfd>
    <286>   DW_AT_data_member_location: 32
 <2><287>: Abbrev Number: 6 (DW_TAG_member)
    <288>   DW_AT_name        : BRR
    <28c>   DW_AT_decl_file   : 4
    <28c>   DW_AT_decl_line   : 560
    <28e>   DW_AT_decl_column : 17
    <28e>   DW_AT_type        : <0xac>
    <292>   DW_AT_data_member_location: 40
 <2><293>: Abbrev Number: 1 (DW_TAG_member)
    <294>   DW_AT_name        : (indirect string, offset: 0x110eab): HSLVR
    <298>   DW_AT_decl_file   : 4
    <299>   DW_AT_decl_line   : 561
    <29b>   DW_AT_decl_column : 17
    <29c>   DW_AT_type        : <0xac>
    <2a0>   DW_AT_data_member_location: 44
 <2><2a1>: Abbrev Number: 1 (DW_TAG_member)
    <2a2>   DW_AT_name        : (indirect string, offset: 0x7ebd9): SECCFGR
    <2a6>   DW_AT_decl_file   : 4
    <2a7>   DW_AT_decl_line   : 562
    <2a9>   DW_AT_decl_column : 17
    <2aa>   DW_AT_type        : <0xac>
    <2ae>   DW_AT_data_member_location: 48
 <2><2af>: Abbrev Number: 0
 <1><2b0>: Abbrev Number: 9 (DW_TAG_typedef)
    <2b1>   DW_AT_name        : (indirect string, offset: 0x953c9): GPIO_TypeDef
    <2b5>   DW_AT_decl_file   : 4
    <2b6>   DW_AT_decl_line   : 563
    <2b8>   DW_AT_decl_column : 3
    <2b8>   DW_AT_type        : <0x206>
 <1><2bc>: Abbrev Number: 10 (DW_TAG_array_type)
    <2bd>   DW_AT_type        : <0xa0>
    <2c1>   DW_AT_sibling     : <0x2cc>
 <2><2c5>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <2c6>   DW_AT_type        : <0x8d>
    <2ca>   DW_AT_upper_bound : 5
 <2><2cb>: Abbrev Number: 0
 <1><2cc>: Abbrev Number: 26 (DW_TAG_structure_type)
    <2cd>   DW_AT_byte_size   : 280
    <2cf>   DW_AT_decl_file   : 4
    <2d0>   DW_AT_decl_line   : 944
    <2d2>   DW_AT_decl_column : 9
    <2d3>   DW_AT_sibling     : <0x65f>
 <2><2d7>: Abbrev Number: 6 (DW_TAG_member)
    <2d8>   DW_AT_name        : CR
    <2db>   DW_AT_decl_file   : 4
    <2db>   DW_AT_decl_line   : 946
    <2dd>   DW_AT_decl_column : 17
    <2dd>   DW_AT_type        : <0xac>
    <2e1>   DW_AT_data_member_location: 0
 <2><2e2>: Abbrev Number: 1 (DW_TAG_member)
    <2e3>   DW_AT_name        : (indirect string, offset: 0x66e1e): RESERVED0
    <2e7>   DW_AT_decl_file   : 4
    <2e8>   DW_AT_decl_line   : 947
    <2ea>   DW_AT_decl_column : 17
    <2eb>   DW_AT_type        : <0xa0>
    <2ef>   DW_AT_data_member_location: 4
 <2><2f0>: Abbrev Number: 1 (DW_TAG_member)
    <2f1>   DW_AT_name        : (indirect string, offset: 0x2c84e): ICSCR1
    <2f5>   DW_AT_decl_file   : 4
    <2f6>   DW_AT_decl_line   : 948
    <2f8>   DW_AT_decl_column : 17
    <2f9>   DW_AT_type        : <0xac>
    <2fd>   DW_AT_data_member_location: 8
 <2><2fe>: Abbrev Number: 1 (DW_TAG_member)
    <2ff>   DW_AT_name        : (indirect string, offset: 0x2c855): ICSCR2
    <303>   DW_AT_decl_file   : 4
    <304>   DW_AT_decl_line   : 949
    <306>   DW_AT_decl_column : 17
    <307>   DW_AT_type        : <0xac>
    <30b>   DW_AT_data_member_location: 12
 <2><30c>: Abbrev Number: 1 (DW_TAG_member)
    <30d>   DW_AT_name        : (indirect string, offset: 0x2c85c): ICSCR3
    <311>   DW_AT_decl_file   : 4
    <312>   DW_AT_decl_line   : 950
    <314>   DW_AT_decl_column : 17
    <315>   DW_AT_type        : <0xac>
    <319>   DW_AT_data_member_location: 16
 <2><31a>: Abbrev Number: 1 (DW_TAG_member)
    <31b>   DW_AT_name        : (indirect string, offset: 0x2dcd7): CRRCR
    <31f>   DW_AT_decl_file   : 4
    <320>   DW_AT_decl_line   : 951
    <322>   DW_AT_decl_column : 17
    <323>   DW_AT_type        : <0xac>
    <327>   DW_AT_data_member_location: 20
 <2><328>: Abbrev Number: 1 (DW_TAG_member)
    <329>   DW_AT_name        : (indirect string, offset: 0x66e28): RESERVED1
    <32d>   DW_AT_decl_file   : 4
    <32e>   DW_AT_decl_line   : 952
    <330>   DW_AT_decl_column : 17
    <331>   DW_AT_type        : <0xa0>
    <335>   DW_AT_data_member_location: 24
 <2><336>: Abbrev Number: 1 (DW_TAG_member)
    <337>   DW_AT_name        : (indirect string, offset: 0x15e0c9): CFGR1
    <33b>   DW_AT_decl_file   : 4
    <33c>   DW_AT_decl_line   : 953
    <33e>   DW_AT_decl_column : 17
    <33f>   DW_AT_type        : <0xac>
    <343>   DW_AT_data_member_location: 28
 <2><344>: Abbrev Number: 1 (DW_TAG_member)
    <345>   DW_AT_name        : (indirect string, offset: 0x15c6a7): CFGR2
    <349>   DW_AT_decl_file   : 4
    <34a>   DW_AT_decl_line   : 954
    <34c>   DW_AT_decl_column : 17
    <34d>   DW_AT_type        : <0xac>
    <351>   DW_AT_data_member_location: 32
 <2><352>: Abbrev Number: 1 (DW_TAG_member)
    <353>   DW_AT_name        : (indirect string, offset: 0x6a8aa): CFGR3
    <357>   DW_AT_decl_file   : 4
    <358>   DW_AT_decl_line   : 955
    <35a>   DW_AT_decl_column : 17
    <35b>   DW_AT_type        : <0xac>
    <35f>   DW_AT_data_member_location: 36
 <2><360>: Abbrev Number: 1 (DW_TAG_member)
    <361>   DW_AT_name        : (indirect string, offset: 0x8f7f5): PLL1CFGR
    <365>   DW_AT_decl_file   : 4
    <366>   DW_AT_decl_line   : 956
    <368>   DW_AT_decl_column : 17
    <369>   DW_AT_type        : <0xac>
    <36d>   DW_AT_data_member_location: 40
 <2><36e>: Abbrev Number: 1 (DW_TAG_member)
    <36f>   DW_AT_name        : (indirect string, offset: 0x14b669): PLL2CFGR
    <373>   DW_AT_decl_file   : 4
    <374>   DW_AT_decl_line   : 957
    <376>   DW_AT_decl_column : 17
    <377>   DW_AT_type        : <0xac>
    <37b>   DW_AT_data_member_location: 44
 <2><37c>: Abbrev Number: 1 (DW_TAG_member)
    <37d>   DW_AT_name        : (indirect string, offset: 0xb3a48): PLL3CFGR
    <381>   DW_AT_decl_file   : 4
    <382>   DW_AT_decl_line   : 958
    <384>   DW_AT_decl_column : 17
    <385>   DW_AT_type        : <0xac>
    <389>   DW_AT_data_member_location: 48
 <2><38a>: Abbrev Number: 1 (DW_TAG_member)
    <38b>   DW_AT_name        : (indirect string, offset: 0x4fbd7): PLL1DIVR
    <38f>   DW_AT_decl_file   : 4
    <390>   DW_AT_decl_line   : 959
    <392>   DW_AT_decl_column : 17
    <393>   DW_AT_type        : <0xac>
    <397>   DW_AT_data_member_location: 52
 <2><398>: Abbrev Number: 1 (DW_TAG_member)
    <399>   DW_AT_name        : (indirect string, offset: 0x11291b): PLL1FRACR
    <39d>   DW_AT_decl_file   : 4
    <39e>   DW_AT_decl_line   : 960
    <3a0>   DW_AT_decl_column : 17
    <3a1>   DW_AT_type        : <0xac>
    <3a5>   DW_AT_data_member_location: 56
 <2><3a6>: Abbrev Number: 1 (DW_TAG_member)
    <3a7>   DW_AT_name        : (indirect string, offset: 0x10c9f9): PLL2DIVR
    <3ab>   DW_AT_decl_file   : 4
    <3ac>   DW_AT_decl_line   : 961
    <3ae>   DW_AT_decl_column : 17
    <3af>   DW_AT_type        : <0xac>
    <3b3>   DW_AT_data_member_location: 60
 <2><3b4>: Abbrev Number: 1 (DW_TAG_member)
    <3b5>   DW_AT_name        : (indirect string, offset: 0x10f804): PLL2FRACR
    <3b9>   DW_AT_decl_file   : 4
    <3ba>   DW_AT_decl_line   : 962
    <3bc>   DW_AT_decl_column : 17
    <3bd>   DW_AT_type        : <0xac>
    <3c1>   DW_AT_data_member_location: 64
 <2><3c2>: Abbrev Number: 1 (DW_TAG_member)
    <3c3>   DW_AT_name        : (indirect string, offset: 0x73a73): PLL3DIVR
    <3c7>   DW_AT_decl_file   : 4
    <3c8>   DW_AT_decl_line   : 963
    <3ca>   DW_AT_decl_column : 17
    <3cb>   DW_AT_type        : <0xac>
    <3cf>   DW_AT_data_member_location: 68
 <2><3d0>: Abbrev Number: 1 (DW_TAG_member)
    <3d1>   DW_AT_name        : (indirect string, offset: 0xba5cd): PLL3FRACR
    <3d5>   DW_AT_decl_file   : 4
    <3d6>   DW_AT_decl_line   : 964
    <3d8>   DW_AT_decl_column : 17
    <3d9>   DW_AT_type        : <0xac>
    <3dd>   DW_AT_data_member_location: 72
 <2><3de>: Abbrev Number: 1 (DW_TAG_member)
    <3df>   DW_AT_name        : (indirect string, offset: 0x66e32): RESERVED2
    <3e3>   DW_AT_decl_file   : 4
    <3e4>   DW_AT_decl_line   : 965
    <3e6>   DW_AT_decl_column : 17
    <3e7>   DW_AT_type        : <0xa0>
    <3eb>   DW_AT_data_member_location: 76
 <2><3ec>: Abbrev Number: 1 (DW_TAG_member)
    <3ed>   DW_AT_name        : (indirect string, offset: 0x15913): CIER
    <3f1>   DW_AT_decl_file   : 4
    <3f2>   DW_AT_decl_line   : 966
    <3f4>   DW_AT_decl_column : 17
    <3f5>   DW_AT_type        : <0xac>
    <3f9>   DW_AT_data_member_location: 80
 <2><3fa>: Abbrev Number: 1 (DW_TAG_member)
    <3fb>   DW_AT_name        : (indirect string, offset: 0x15d7d): CIFR
    <3ff>   DW_AT_decl_file   : 4
    <400>   DW_AT_decl_line   : 967
    <402>   DW_AT_decl_column : 17
    <403>   DW_AT_type        : <0xac>
    <407>   DW_AT_data_member_location: 84
 <2><408>: Abbrev Number: 1 (DW_TAG_member)
    <409>   DW_AT_name        : (indirect string, offset: 0x14e21): CICR
    <40d>   DW_AT_decl_file   : 4
    <40e>   DW_AT_decl_line   : 968
    <410>   DW_AT_decl_column : 17
    <411>   DW_AT_type        : <0xac>
    <415>   DW_AT_data_member_location: 88
 <2><416>: Abbrev Number: 1 (DW_TAG_member)
    <417>   DW_AT_name        : (indirect string, offset: 0x66e3c): RESERVED3
    <41b>   DW_AT_decl_file   : 4
    <41c>   DW_AT_decl_line   : 969
    <41e>   DW_AT_decl_column : 17
    <41f>   DW_AT_type        : <0xa0>
    <423>   DW_AT_data_member_location: 92
 <2><424>: Abbrev Number: 1 (DW_TAG_member)
    <425>   DW_AT_name        : (indirect string, offset: 0x13dcf3): AHB1RSTR
    <429>   DW_AT_decl_file   : 4
    <42a>   DW_AT_decl_line   : 970
    <42c>   DW_AT_decl_column : 17
    <42d>   DW_AT_type        : <0xac>
    <431>   DW_AT_data_member_location: 96
 <2><432>: Abbrev Number: 1 (DW_TAG_member)
    <433>   DW_AT_name        : (indirect string, offset: 0x89476): AHB2RSTR1
    <437>   DW_AT_decl_file   : 4
    <438>   DW_AT_decl_line   : 971
    <43a>   DW_AT_decl_column : 17
    <43b>   DW_AT_type        : <0xac>
    <43f>   DW_AT_data_member_location: 100
 <2><440>: Abbrev Number: 1 (DW_TAG_member)
    <441>   DW_AT_name        : (indirect string, offset: 0x89480): AHB2RSTR2
    <445>   DW_AT_decl_file   : 4
    <446>   DW_AT_decl_line   : 972
    <448>   DW_AT_decl_column : 17
    <449>   DW_AT_type        : <0xac>
    <44d>   DW_AT_data_member_location: 104
 <2><44e>: Abbrev Number: 1 (DW_TAG_member)
    <44f>   DW_AT_name        : (indirect string, offset: 0xd74f): AHB3RSTR
    <453>   DW_AT_decl_file   : 4
    <454>   DW_AT_decl_line   : 973
    <456>   DW_AT_decl_column : 17
    <457>   DW_AT_type        : <0xac>
    <45b>   DW_AT_data_member_location: 108
 <2><45c>: Abbrev Number: 1 (DW_TAG_member)
    <45d>   DW_AT_name        : (indirect string, offset: 0x66e46): RESERVED4
    <461>   DW_AT_decl_file   : 4
    <462>   DW_AT_decl_line   : 974
    <464>   DW_AT_decl_column : 17
    <465>   DW_AT_type        : <0xa0>
    <469>   DW_AT_data_member_location: 112
 <2><46a>: Abbrev Number: 1 (DW_TAG_member)
    <46b>   DW_AT_name        : (indirect string, offset: 0x80190): APB1RSTR1
    <46f>   DW_AT_decl_file   : 4
    <470>   DW_AT_decl_line   : 975
    <472>   DW_AT_decl_column : 17
    <473>   DW_AT_type        : <0xac>
    <477>   DW_AT_data_member_location: 116
 <2><478>: Abbrev Number: 1 (DW_TAG_member)
    <479>   DW_AT_name        : (indirect string, offset: 0xeaced): APB1RSTR2
    <47d>   DW_AT_decl_file   : 4
    <47e>   DW_AT_decl_line   : 976
    <480>   DW_AT_decl_column : 17
    <481>   DW_AT_type        : <0xac>
    <485>   DW_AT_data_member_location: 120
 <2><486>: Abbrev Number: 1 (DW_TAG_member)
    <487>   DW_AT_name        : (indirect string, offset: 0x11f32a): APB2RSTR
    <48b>   DW_AT_decl_file   : 4
    <48c>   DW_AT_decl_line   : 977
    <48e>   DW_AT_decl_column : 17
    <48f>   DW_AT_type        : <0xac>
    <493>   DW_AT_data_member_location: 124
 <2><494>: Abbrev Number: 1 (DW_TAG_member)
    <495>   DW_AT_name        : (indirect string, offset: 0x855c1): APB3RSTR
    <499>   DW_AT_decl_file   : 4
    <49a>   DW_AT_decl_line   : 978
    <49c>   DW_AT_decl_column : 17
    <49d>   DW_AT_type        : <0xac>
    <4a1>   DW_AT_data_member_location: 128
 <2><4a2>: Abbrev Number: 1 (DW_TAG_member)
    <4a3>   DW_AT_name        : (indirect string, offset: 0x66e50): RESERVED5
    <4a7>   DW_AT_decl_file   : 4
    <4a8>   DW_AT_decl_line   : 979
    <4aa>   DW_AT_decl_column : 17
    <4ab>   DW_AT_type        : <0xa0>
    <4af>   DW_AT_data_member_location: 132
 <2><4b0>: Abbrev Number: 1 (DW_TAG_member)
    <4b1>   DW_AT_name        : (indirect string, offset: 0xad112): AHB1ENR
    <4b5>   DW_AT_decl_file   : 4
    <4b6>   DW_AT_decl_line   : 980
    <4b8>   DW_AT_decl_column : 17
    <4b9>   DW_AT_type        : <0xac>
    <4bd>   DW_AT_data_member_location: 136
 <2><4be>: Abbrev Number: 1 (DW_TAG_member)
    <4bf>   DW_AT_name        : (indirect string, offset: 0x9e076): AHB2ENR1
    <4c3>   DW_AT_decl_file   : 4
    <4c4>   DW_AT_decl_line   : 981
    <4c6>   DW_AT_decl_column : 17
    <4c7>   DW_AT_type        : <0xac>
    <4cb>   DW_AT_data_member_location: 140
 <2><4cc>: Abbrev Number: 1 (DW_TAG_member)
    <4cd>   DW_AT_name        : (indirect string, offset: 0x9e07f): AHB2ENR2
    <4d1>   DW_AT_decl_file   : 4
    <4d2>   DW_AT_decl_line   : 982
    <4d4>   DW_AT_decl_column : 17
    <4d5>   DW_AT_type        : <0xac>
    <4d9>   DW_AT_data_member_location: 144
 <2><4da>: Abbrev Number: 1 (DW_TAG_member)
    <4db>   DW_AT_name        : (indirect string, offset: 0xeb7aa): AHB3ENR
    <4df>   DW_AT_decl_file   : 4
    <4e0>   DW_AT_decl_line   : 983
    <4e2>   DW_AT_decl_column : 17
    <4e3>   DW_AT_type        : <0xac>
    <4e7>   DW_AT_data_member_location: 148
 <2><4e8>: Abbrev Number: 1 (DW_TAG_member)
    <4e9>   DW_AT_name        : (indirect string, offset: 0xb3bee): RESERVED6
    <4ed>   DW_AT_decl_file   : 4
    <4ee>   DW_AT_decl_line   : 984
    <4f0>   DW_AT_decl_column : 17
    <4f1>   DW_AT_type        : <0xa0>
    <4f5>   DW_AT_data_member_location: 152
 <2><4f6>: Abbrev Number: 1 (DW_TAG_member)
    <4f7>   DW_AT_name        : (indirect string, offset: 0x5cf6c): APB1ENR1
    <4fb>   DW_AT_decl_file   : 4
    <4fc>   DW_AT_decl_line   : 985
    <4fe>   DW_AT_decl_column : 17
    <4ff>   DW_AT_type        : <0xac>
    <503>   DW_AT_data_member_location: 156
 <2><504>: Abbrev Number: 1 (DW_TAG_member)
    <505>   DW_AT_name        : (indirect string, offset: 0x5cf75): APB1ENR2
    <509>   DW_AT_decl_file   : 4
    <50a>   DW_AT_decl_line   : 986
    <50c>   DW_AT_decl_column : 17
    <50d>   DW_AT_type        : <0xac>
    <511>   DW_AT_data_member_location: 160
 <2><512>: Abbrev Number: 1 (DW_TAG_member)
    <513>   DW_AT_name        : (indirect string, offset: 0x5434): APB2ENR
    <517>   DW_AT_decl_file   : 4
    <518>   DW_AT_decl_line   : 987
    <51a>   DW_AT_decl_column : 17
    <51b>   DW_AT_type        : <0xac>
    <51f>   DW_AT_data_member_location: 164
 <2><520>: Abbrev Number: 1 (DW_TAG_member)
    <521>   DW_AT_name        : (indirect string, offset: 0xcda6c): APB3ENR
    <525>   DW_AT_decl_file   : 4
    <526>   DW_AT_decl_line   : 988
    <528>   DW_AT_decl_column : 17
    <529>   DW_AT_type        : <0xac>
    <52d>   DW_AT_data_member_location: 168
 <2><52e>: Abbrev Number: 1 (DW_TAG_member)
    <52f>   DW_AT_name        : (indirect string, offset: 0xb3bf8): RESERVED7
    <533>   DW_AT_decl_file   : 4
    <534>   DW_AT_decl_line   : 989
    <536>   DW_AT_decl_column : 17
    <537>   DW_AT_type        : <0xa0>
    <53b>   DW_AT_data_member_location: 172
 <2><53c>: Abbrev Number: 1 (DW_TAG_member)
    <53d>   DW_AT_name        : (indirect string, offset: 0x852e8): AHB1SMENR
    <541>   DW_AT_decl_file   : 4
    <542>   DW_AT_decl_line   : 990
    <544>   DW_AT_decl_column : 17
    <545>   DW_AT_type        : <0xac>
    <549>   DW_AT_data_member_location: 176
 <2><54a>: Abbrev Number: 1 (DW_TAG_member)
    <54b>   DW_AT_name        : (indirect string, offset: 0xe0575): AHB2SMENR1
    <54f>   DW_AT_decl_file   : 4
    <550>   DW_AT_decl_line   : 991
    <552>   DW_AT_decl_column : 17
    <553>   DW_AT_type        : <0xac>
    <557>   DW_AT_data_member_location: 180
 <2><558>: Abbrev Number: 1 (DW_TAG_member)
    <559>   DW_AT_name        : (indirect string, offset: 0xe0580): AHB2SMENR2
    <55d>   DW_AT_decl_file   : 4
    <55e>   DW_AT_decl_line   : 992
    <560>   DW_AT_decl_column : 17
    <561>   DW_AT_type        : <0xac>
    <565>   DW_AT_data_member_location: 184
 <2><566>: Abbrev Number: 1 (DW_TAG_member)
    <567>   DW_AT_name        : (indirect string, offset: 0x7ecde): AHB3SMENR
    <56b>   DW_AT_decl_file   : 4
    <56c>   DW_AT_decl_line   : 993
    <56e>   DW_AT_decl_column : 17
    <56f>   DW_AT_type        : <0xac>
    <573>   DW_AT_data_member_location: 188
 <2><574>: Abbrev Number: 1 (DW_TAG_member)
    <575>   DW_AT_name        : (indirect string, offset: 0xb3c02): RESERVED8
    <579>   DW_AT_decl_file   : 4
    <57a>   DW_AT_decl_line   : 994
    <57c>   DW_AT_decl_column : 17
    <57d>   DW_AT_type        : <0xa0>
    <581>   DW_AT_data_member_location: 192
 <2><582>: Abbrev Number: 1 (DW_TAG_member)
    <583>   DW_AT_name        : (indirect string, offset: 0xeffc4): APB1SMENR1
    <587>   DW_AT_decl_file   : 4
    <588>   DW_AT_decl_line   : 995
    <58a>   DW_AT_decl_column : 17
    <58b>   DW_AT_type        : <0xac>
    <58f>   DW_AT_data_member_location: 196
 <2><590>: Abbrev Number: 1 (DW_TAG_member)
    <591>   DW_AT_name        : (indirect string, offset: 0xeffcf): APB1SMENR2
    <595>   DW_AT_decl_file   : 4
    <596>   DW_AT_decl_line   : 996
    <598>   DW_AT_decl_column : 17
    <599>   DW_AT_type        : <0xac>
    <59d>   DW_AT_data_member_location: 200
 <2><59e>: Abbrev Number: 1 (DW_TAG_member)
    <59f>   DW_AT_name        : (indirect string, offset: 0x74ee2): APB2SMENR
    <5a3>   DW_AT_decl_file   : 4
    <5a4>   DW_AT_decl_line   : 997
    <5a6>   DW_AT_decl_column : 17
    <5a7>   DW_AT_type        : <0xac>
    <5ab>   DW_AT_data_member_location: 204
 <2><5ac>: Abbrev Number: 1 (DW_TAG_member)
    <5ad>   DW_AT_name        : (indirect string, offset: 0x71e24): APB3SMENR
    <5b1>   DW_AT_decl_file   : 4
    <5b2>   DW_AT_decl_line   : 998
    <5b4>   DW_AT_decl_column : 17
    <5b5>   DW_AT_type        : <0xac>
    <5b9>   DW_AT_data_member_location: 208
 <2><5ba>: Abbrev Number: 1 (DW_TAG_member)
    <5bb>   DW_AT_name        : (indirect string, offset: 0xb3c25): RESERVED9
    <5bf>   DW_AT_decl_file   : 4
    <5c0>   DW_AT_decl_line   : 999
    <5c2>   DW_AT_decl_column : 17
    <5c3>   DW_AT_type        : <0xa0>
    <5c7>   DW_AT_data_member_location: 212
 <2><5c8>: Abbrev Number: 1 (DW_TAG_member)
    <5c9>   DW_AT_name        : (indirect string, offset: 0x6a5c1): SRDAMR
    <5cd>   DW_AT_decl_file   : 4
    <5ce>   DW_AT_decl_line   : 1000
    <5d0>   DW_AT_decl_column : 17
    <5d1>   DW_AT_type        : <0xac>
    <5d5>   DW_AT_data_member_location: 216
 <2><5d6>: Abbrev Number: 1 (DW_TAG_member)
    <5d7>   DW_AT_name        : (indirect string, offset: 0x1401c3): RESERVED10
    <5db>   DW_AT_decl_file   : 4
    <5dc>   DW_AT_decl_line   : 1001
    <5de>   DW_AT_decl_column : 17
    <5df>   DW_AT_type        : <0xa0>
    <5e3>   DW_AT_data_member_location: 220
 <2><5e4>: Abbrev Number: 1 (DW_TAG_member)
    <5e5>   DW_AT_name        : (indirect string, offset: 0x3df4a): CCIPR1
    <5e9>   DW_AT_decl_file   : 4
    <5ea>   DW_AT_decl_line   : 1002
    <5ec>   DW_AT_decl_column : 17
    <5ed>   DW_AT_type        : <0xac>
    <5f1>   DW_AT_data_member_location: 224
 <2><5f2>: Abbrev Number: 1 (DW_TAG_member)
    <5f3>   DW_AT_name        : (indirect string, offset: 0x3df51): CCIPR2
    <5f7>   DW_AT_decl_file   : 4
    <5f8>   DW_AT_decl_line   : 1003
    <5fa>   DW_AT_decl_column : 17
    <5fb>   DW_AT_type        : <0xac>
    <5ff>   DW_AT_data_member_location: 228
 <2><600>: Abbrev Number: 1 (DW_TAG_member)
    <601>   DW_AT_name        : (indirect string, offset: 0x3df58): CCIPR3
    <605>   DW_AT_decl_file   : 4
    <606>   DW_AT_decl_line   : 1004
    <608>   DW_AT_decl_column : 17
    <609>   DW_AT_type        : <0xac>
    <60d>   DW_AT_data_member_location: 232
 <2><60e>: Abbrev Number: 1 (DW_TAG_member)
    <60f>   DW_AT_name        : (indirect string, offset: 0x1401ce): RESERVED11
    <613>   DW_AT_decl_file   : 4
    <614>   DW_AT_decl_line   : 1005
    <616>   DW_AT_decl_column : 17
    <617>   DW_AT_type        : <0xa0>
    <61b>   DW_AT_data_member_location: 236
 <2><61c>: Abbrev Number: 1 (DW_TAG_member)
    <61d>   DW_AT_name        : (indirect string, offset: 0x2acbc): BDCR
    <621>   DW_AT_decl_file   : 4
    <622>   DW_AT_decl_line   : 1006
    <624>   DW_AT_decl_column : 17
    <625>   DW_AT_type        : <0xac>
    <629>   DW_AT_data_member_location: 240
 <2><62a>: Abbrev Number: 6 (DW_TAG_member)
    <62b>   DW_AT_name        : CSR
    <62f>   DW_AT_decl_file   : 4
    <62f>   DW_AT_decl_line   : 1007
    <631>   DW_AT_decl_column : 17
    <631>   DW_AT_type        : <0xac>
    <635>   DW_AT_data_member_location: 244
 <2><636>: Abbrev Number: 1 (DW_TAG_member)
    <637>   DW_AT_name        : (indirect string, offset: 0x138176): RESERVED
    <63b>   DW_AT_decl_file   : 4
    <63c>   DW_AT_decl_line   : 1008
    <63e>   DW_AT_decl_column : 17
    <63f>   DW_AT_type        : <0x2bc>
    <643>   DW_AT_data_member_location: 248
 <2><644>: Abbrev Number: 17 (DW_TAG_member)
    <645>   DW_AT_name        : (indirect string, offset: 0x7ebd9): SECCFGR
    <649>   DW_AT_decl_file   : 4
    <649>   DW_AT_decl_line   : 1009
    <64b>   DW_AT_decl_column : 17
    <64b>   DW_AT_type        : <0xac>
    <64f>   DW_AT_data_member_location: 272
 <2><651>: Abbrev Number: 17 (DW_TAG_member)
    <652>   DW_AT_name        : (indirect string, offset: 0xddbdb): PRIVCFGR
    <656>   DW_AT_decl_file   : 4
    <656>   DW_AT_decl_line   : 1010
    <658>   DW_AT_decl_column : 17
    <658>   DW_AT_type        : <0xac>
    <65c>   DW_AT_data_member_location: 276
 <2><65e>: Abbrev Number: 0
 <1><65f>: Abbrev Number: 9 (DW_TAG_typedef)
    <660>   DW_AT_name        : (indirect string, offset: 0xbf9f7): RCC_TypeDef
    <664>   DW_AT_decl_file   : 4
    <665>   DW_AT_decl_line   : 1011
    <667>   DW_AT_decl_column : 3
    <667>   DW_AT_type        : <0x2cc>
 <1><66b>: Abbrev Number: 13 (DW_TAG_structure_type)
    <66c>   DW_AT_byte_size   : 212
    <66d>   DW_AT_decl_file   : 4
    <66e>   DW_AT_decl_line   : 1465
    <670>   DW_AT_decl_column : 9
    <670>   DW_AT_sibling     : <0x8de>
 <2><674>: Abbrev Number: 6 (DW_TAG_member)
    <675>   DW_AT_name        : ISR
    <679>   DW_AT_decl_file   : 4
    <679>   DW_AT_decl_line   : 1467
    <67b>   DW_AT_decl_column : 17
    <67b>   DW_AT_type        : <0xac>
    <67f>   DW_AT_data_member_location: 0
 <2><680>: Abbrev Number: 6 (DW_TAG_member)
    <681>   DW_AT_name        : IER
    <685>   DW_AT_decl_file   : 4
    <685>   DW_AT_decl_line   : 1468
    <687>   DW_AT_decl_column : 17
    <687>   DW_AT_type        : <0xac>
    <68b>   DW_AT_data_member_location: 4
 <2><68c>: Abbrev Number: 6 (DW_TAG_member)
    <68d>   DW_AT_name        : CR
    <690>   DW_AT_decl_file   : 4
    <690>   DW_AT_decl_line   : 1469
    <692>   DW_AT_decl_column : 17
    <692>   DW_AT_type        : <0xac>
    <696>   DW_AT_data_member_location: 8
 <2><697>: Abbrev Number: 1 (DW_TAG_member)
    <698>   DW_AT_name        : (indirect string, offset: 0x15e0c9): CFGR1
    <69c>   DW_AT_decl_file   : 4
    <69d>   DW_AT_decl_line   : 1470
    <69f>   DW_AT_decl_column : 17
    <6a0>   DW_AT_type        : <0xac>
    <6a4>   DW_AT_data_member_location: 12
 <2><6a5>: Abbrev Number: 1 (DW_TAG_member)
    <6a6>   DW_AT_name        : (indirect string, offset: 0x15c6a7): CFGR2
    <6aa>   DW_AT_decl_file   : 4
    <6ab>   DW_AT_decl_line   : 1471
    <6ad>   DW_AT_decl_column : 17
    <6ae>   DW_AT_type        : <0xac>
    <6b2>   DW_AT_data_member_location: 16
 <2><6b3>: Abbrev Number: 1 (DW_TAG_member)
    <6b4>   DW_AT_name        : (indirect string, offset: 0xc35ca): SMPR1
    <6b8>   DW_AT_decl_file   : 4
    <6b9>   DW_AT_decl_line   : 1472
    <6bb>   DW_AT_decl_column : 17
    <6bc>   DW_AT_type        : <0xac>
    <6c0>   DW_AT_data_member_location: 20
 <2><6c1>: Abbrev Number: 1 (DW_TAG_member)
    <6c2>   DW_AT_name        : (indirect string, offset: 0x12720f): SMPR2
    <6c6>   DW_AT_decl_file   : 4
    <6c7>   DW_AT_decl_line   : 1473
    <6c9>   DW_AT_decl_column : 17
    <6ca>   DW_AT_type        : <0xac>
    <6ce>   DW_AT_data_member_location: 24
 <2><6cf>: Abbrev Number: 1 (DW_TAG_member)
    <6d0>   DW_AT_name        : (indirect string, offset: 0xb37a6): PCSEL
    <6d4>   DW_AT_decl_file   : 4
    <6d5>   DW_AT_decl_line   : 1474
    <6d7>   DW_AT_decl_column : 17
    <6d8>   DW_AT_type        : <0xac>
    <6dc>   DW_AT_data_member_location: 28
 <2><6dd>: Abbrev Number: 1 (DW_TAG_member)
    <6de>   DW_AT_name        : (indirect string, offset: 0x3aca7): AWD1TR
    <6e2>   DW_AT_decl_file   : 4
    <6e3>   DW_AT_decl_line   : 1475
    <6e5>   DW_AT_decl_column : 17
    <6e6>   DW_AT_type        : <0xac>
    <6ea>   DW_AT_data_member_location: 32
 <2><6eb>: Abbrev Number: 1 (DW_TAG_member)
    <6ec>   DW_AT_name        : (indirect string, offset: 0x142f5): AWD2TR
    <6f0>   DW_AT_decl_file   : 4
    <6f1>   DW_AT_decl_line   : 1476
    <6f3>   DW_AT_decl_column : 17
    <6f4>   DW_AT_type        : <0xac>
    <6f8>   DW_AT_data_member_location: 36
 <2><6f9>: Abbrev Number: 1 (DW_TAG_member)
    <6fa>   DW_AT_name        : (indirect string, offset: 0x1d893): CHSELR
    <6fe>   DW_AT_decl_file   : 4
    <6ff>   DW_AT_decl_line   : 1477
    <701>   DW_AT_decl_column : 17
    <702>   DW_AT_type        : <0xac>
    <706>   DW_AT_data_member_location: 40
 <2><707>: Abbrev Number: 1 (DW_TAG_member)
    <708>   DW_AT_name        : (indirect string, offset: 0x69fb9): AWD3TR
    <70c>   DW_AT_decl_file   : 4
    <70d>   DW_AT_decl_line   : 1478
    <70f>   DW_AT_decl_column : 17
    <710>   DW_AT_type        : <0xac>
    <714>   DW_AT_data_member_location: 44
 <2><715>: Abbrev Number: 1 (DW_TAG_member)
    <716>   DW_AT_name        : (indirect string, offset: 0x60f45): SQR1
    <71a>   DW_AT_decl_file   : 4
    <71b>   DW_AT_decl_line   : 1479
    <71d>   DW_AT_decl_column : 17
    <71e>   DW_AT_type        : <0xac>
    <722>   DW_AT_data_member_location: 48
 <2><723>: Abbrev Number: 1 (DW_TAG_member)
    <724>   DW_AT_name        : (indirect string, offset: 0x17462): SQR2
    <728>   DW_AT_decl_file   : 4
    <729>   DW_AT_decl_line   : 1480
    <72b>   DW_AT_decl_column : 17
    <72c>   DW_AT_type        : <0xac>
    <730>   DW_AT_data_member_location: 52
 <2><731>: Abbrev Number: 1 (DW_TAG_member)
    <732>   DW_AT_name        : (indirect string, offset: 0x17467): SQR3
    <736>   DW_AT_decl_file   : 4
    <737>   DW_AT_decl_line   : 1481
    <739>   DW_AT_decl_column : 17
    <73a>   DW_AT_type        : <0xac>
    <73e>   DW_AT_data_member_location: 56
 <2><73f>: Abbrev Number: 1 (DW_TAG_member)
    <740>   DW_AT_name        : (indirect string, offset: 0x1746c): SQR4
    <744>   DW_AT_decl_file   : 4
    <745>   DW_AT_decl_line   : 1482
    <747>   DW_AT_decl_column : 17
    <748>   DW_AT_type        : <0xac>
    <74c>   DW_AT_data_member_location: 60
 <2><74d>: Abbrev Number: 6 (DW_TAG_member)
    <74e>   DW_AT_name        : DR
    <751>   DW_AT_decl_file   : 4
    <751>   DW_AT_decl_line   : 1483
    <753>   DW_AT_decl_column : 17
    <753>   DW_AT_type        : <0xac>
    <757>   DW_AT_data_member_location: 64
 <2><758>: Abbrev Number: 1 (DW_TAG_member)
    <759>   DW_AT_name        : (indirect string, offset: 0xb6485): PWRR
    <75d>   DW_AT_decl_file   : 4
    <75e>   DW_AT_decl_line   : 1484
    <760>   DW_AT_decl_column : 17
    <761>   DW_AT_type        : <0xac>
    <765>   DW_AT_data_member_location: 68
 <2><766>: Abbrev Number: 1 (DW_TAG_member)
    <767>   DW_AT_name        : (indirect string, offset: 0x66e28): RESERVED1
    <76b>   DW_AT_decl_file   : 4
    <76c>   DW_AT_decl_line   : 1485
    <76e>   DW_AT_decl_column : 17
    <76f>   DW_AT_type        : <0xa0>
    <773>   DW_AT_data_member_location: 72
 <2><774>: Abbrev Number: 1 (DW_TAG_member)
    <775>   DW_AT_name        : (indirect string, offset: 0x26f41): JSQR
    <779>   DW_AT_decl_file   : 4
    <77a>   DW_AT_decl_line   : 1486
    <77c>   DW_AT_decl_column : 17
    <77d>   DW_AT_type        : <0xac>
    <781>   DW_AT_data_member_location: 76
 <2><782>: Abbrev Number: 1 (DW_TAG_member)
    <783>   DW_AT_name        : (indirect string, offset: 0x66e32): RESERVED2
    <787>   DW_AT_decl_file   : 4
    <788>   DW_AT_decl_line   : 1487
    <78a>   DW_AT_decl_column : 17
    <78b>   DW_AT_type        : <0xbd>
    <78f>   DW_AT_data_member_location: 80
 <2><790>: Abbrev Number: 1 (DW_TAG_member)
    <791>   DW_AT_name        : (indirect string, offset: 0x143f85): OFR1
    <795>   DW_AT_decl_file   : 4
    <796>   DW_AT_decl_line   : 1488
    <798>   DW_AT_decl_column : 17
    <799>   DW_AT_type        : <0xac>
    <79d>   DW_AT_data_member_location: 96
 <2><79e>: Abbrev Number: 1 (DW_TAG_member)
    <79f>   DW_AT_name        : (indirect string, offset: 0x143f8a): OFR2
    <7a3>   DW_AT_decl_file   : 4
    <7a4>   DW_AT_decl_line   : 1489
    <7a6>   DW_AT_decl_column : 17
    <7a7>   DW_AT_type        : <0xac>
    <7ab>   DW_AT_data_member_location: 100
 <2><7ac>: Abbrev Number: 1 (DW_TAG_member)
    <7ad>   DW_AT_name        : (indirect string, offset: 0x143f8f): OFR3
    <7b1>   DW_AT_decl_file   : 4
    <7b2>   DW_AT_decl_line   : 1490
    <7b4>   DW_AT_decl_column : 17
    <7b5>   DW_AT_type        : <0xac>
    <7b9>   DW_AT_data_member_location: 104
 <2><7ba>: Abbrev Number: 1 (DW_TAG_member)
    <7bb>   DW_AT_name        : (indirect string, offset: 0x133cf3): OFR4
    <7bf>   DW_AT_decl_file   : 4
    <7c0>   DW_AT_decl_line   : 1491
    <7c2>   DW_AT_decl_column : 17
    <7c3>   DW_AT_type        : <0xac>
    <7c7>   DW_AT_data_member_location: 108
 <2><7c8>: Abbrev Number: 1 (DW_TAG_member)
    <7c9>   DW_AT_name        : (indirect string, offset: 0x64506): GCOMP
    <7cd>   DW_AT_decl_file   : 4
    <7ce>   DW_AT_decl_line   : 1492
    <7d0>   DW_AT_decl_column : 17
    <7d1>   DW_AT_type        : <0xac>
    <7d5>   DW_AT_data_member_location: 112
 <2><7d6>: Abbrev Number: 1 (DW_TAG_member)
    <7d7>   DW_AT_name        : (indirect string, offset: 0x66e3c): RESERVED3
    <7db>   DW_AT_decl_file   : 4
    <7dc>   DW_AT_decl_line   : 1493
    <7de>   DW_AT_decl_column : 17
    <7df>   DW_AT_type        : <0x1f6>
    <7e3>   DW_AT_data_member_location: 116
 <2><7e4>: Abbrev Number: 1 (DW_TAG_member)
    <7e5>   DW_AT_name        : (indirect string, offset: 0x126be4): JDR1
    <7e9>   DW_AT_decl_file   : 4
    <7ea>   DW_AT_decl_line   : 1494
    <7ec>   DW_AT_decl_column : 17
    <7ed>   DW_AT_type        : <0xac>
    <7f1>   DW_AT_data_member_location: 128
 <2><7f2>: Abbrev Number: 1 (DW_TAG_member)
    <7f3>   DW_AT_name        : (indirect string, offset: 0xf7640): JDR2
    <7f7>   DW_AT_decl_file   : 4
    <7f8>   DW_AT_decl_line   : 1495
    <7fa>   DW_AT_decl_column : 17
    <7fb>   DW_AT_type        : <0xac>
    <7ff>   DW_AT_data_member_location: 132
 <2><800>: Abbrev Number: 1 (DW_TAG_member)
    <801>   DW_AT_name        : (indirect string, offset: 0x126c39): JDR3
    <805>   DW_AT_decl_file   : 4
    <806>   DW_AT_decl_line   : 1496
    <808>   DW_AT_decl_column : 17
    <809>   DW_AT_type        : <0xac>
    <80d>   DW_AT_data_member_location: 136
 <2><80e>: Abbrev Number: 1 (DW_TAG_member)
    <80f>   DW_AT_name        : (indirect string, offset: 0x126c3e): JDR4
    <813>   DW_AT_decl_file   : 4
    <814>   DW_AT_decl_line   : 1497
    <816>   DW_AT_decl_column : 17
    <817>   DW_AT_type        : <0xac>
    <81b>   DW_AT_data_member_location: 140
 <2><81c>: Abbrev Number: 1 (DW_TAG_member)
    <81d>   DW_AT_name        : (indirect string, offset: 0x66e46): RESERVED4
    <821>   DW_AT_decl_file   : 4
    <822>   DW_AT_decl_line   : 1498
    <824>   DW_AT_decl_column : 17
    <825>   DW_AT_type        : <0xbd>
    <829>   DW_AT_data_member_location: 144
 <2><82a>: Abbrev Number: 1 (DW_TAG_member)
    <82b>   DW_AT_name        : (indirect string, offset: 0x4c423): AWD2CR
    <82f>   DW_AT_decl_file   : 4
    <830>   DW_AT_decl_line   : 1499
    <832>   DW_AT_decl_column : 17
    <833>   DW_AT_type        : <0xac>
    <837>   DW_AT_data_member_location: 160
 <2><838>: Abbrev Number: 1 (DW_TAG_member)
    <839>   DW_AT_name        : (indirect string, offset: 0x6478c): AWD3CR
    <83d>   DW_AT_decl_file   : 4
    <83e>   DW_AT_decl_line   : 1500
    <840>   DW_AT_decl_column : 17
    <841>   DW_AT_type        : <0xac>
    <845>   DW_AT_data_member_location: 164
 <2><846>: Abbrev Number: 1 (DW_TAG_member)
    <847>   DW_AT_name        : (indirect string, offset: 0x2ffc9): LTR1
    <84b>   DW_AT_decl_file   : 4
    <84c>   DW_AT_decl_line   : 1501
    <84e>   DW_AT_decl_column : 17
    <84f>   DW_AT_type        : <0xac>
    <853>   DW_AT_data_member_location: 168
 <2><854>: Abbrev Number: 1 (DW_TAG_member)
    <855>   DW_AT_name        : (indirect string, offset: 0x109e69): HTR1
    <859>   DW_AT_decl_file   : 4
    <85a>   DW_AT_decl_line   : 1502
    <85c>   DW_AT_decl_column : 17
    <85d>   DW_AT_type        : <0xac>
    <861>   DW_AT_data_member_location: 172
 <2><862>: Abbrev Number: 1 (DW_TAG_member)
    <863>   DW_AT_name        : (indirect string, offset: 0x5fe9c): LTR2
    <867>   DW_AT_decl_file   : 4
    <868>   DW_AT_decl_line   : 1503
    <86a>   DW_AT_decl_column : 17
    <86b>   DW_AT_type        : <0xac>
    <86f>   DW_AT_data_member_location: 176
 <2><870>: Abbrev Number: 1 (DW_TAG_member)
    <871>   DW_AT_name        : (indirect string, offset: 0x109e6e): HTR2
    <875>   DW_AT_decl_file   : 4
    <876>   DW_AT_decl_line   : 1504
    <878>   DW_AT_decl_column : 17
    <879>   DW_AT_type        : <0xac>
    <87d>   DW_AT_data_member_location: 180
 <2><87e>: Abbrev Number: 1 (DW_TAG_member)
    <87f>   DW_AT_name        : (indirect string, offset: 0x5fec1): LTR3
    <883>   DW_AT_decl_file   : 4
    <884>   DW_AT_decl_line   : 1505
    <886>   DW_AT_decl_column : 17
    <887>   DW_AT_type        : <0xac>
    <88b>   DW_AT_data_member_location: 184
 <2><88c>: Abbrev Number: 1 (DW_TAG_member)
    <88d>   DW_AT_name        : (indirect string, offset: 0x109e73): HTR3
    <891>   DW_AT_decl_file   : 4
    <892>   DW_AT_decl_line   : 1506
    <894>   DW_AT_decl_column : 17
    <895>   DW_AT_type        : <0xac>
    <899>   DW_AT_data_member_location: 188
 <2><89a>: Abbrev Number: 1 (DW_TAG_member)
    <89b>   DW_AT_name        : (indirect string, offset: 0x30778): DIFSEL
    <89f>   DW_AT_decl_file   : 4
    <8a0>   DW_AT_decl_line   : 1507
    <8a2>   DW_AT_decl_column : 17
    <8a3>   DW_AT_type        : <0xac>
    <8a7>   DW_AT_data_member_location: 192
 <2><8a8>: Abbrev Number: 1 (DW_TAG_member)
    <8a9>   DW_AT_name        : (indirect string, offset: 0x112390): CALFACT
    <8ad>   DW_AT_decl_file   : 4
    <8ae>   DW_AT_decl_line   : 1508
    <8b0>   DW_AT_decl_column : 17
    <8b1>   DW_AT_type        : <0xac>
    <8b5>   DW_AT_data_member_location: 196
 <2><8b6>: Abbrev Number: 1 (DW_TAG_member)
    <8b7>   DW_AT_name        : (indirect string, offset: 0xf4a5a): CALFACT2
    <8bb>   DW_AT_decl_file   : 4
    <8bc>   DW_AT_decl_line   : 1509
    <8be>   DW_AT_decl_column : 17
    <8bf>   DW_AT_type        : <0xac>
    <8c3>   DW_AT_data_member_location: 200
 <2><8c4>: Abbrev Number: 1 (DW_TAG_member)
    <8c5>   DW_AT_name        : (indirect string, offset: 0x66e50): RESERVED5
    <8c9>   DW_AT_decl_file   : 4
    <8ca>   DW_AT_decl_line   : 1510
    <8cc>   DW_AT_decl_column : 17
    <8cd>   DW_AT_type        : <0xa0>
    <8d1>   DW_AT_data_member_location: 204
 <2><8d2>: Abbrev Number: 6 (DW_TAG_member)
    <8d3>   DW_AT_name        : OR
    <8d6>   DW_AT_decl_file   : 4
    <8d6>   DW_AT_decl_line   : 1511
    <8d8>   DW_AT_decl_column : 17
    <8d8>   DW_AT_type        : <0xac>
    <8dc>   DW_AT_data_member_location: 208
 <2><8dd>: Abbrev Number: 0
 <1><8de>: Abbrev Number: 9 (DW_TAG_typedef)
    <8df>   DW_AT_name        : (indirect string, offset: 0xc952): ADC_TypeDef
    <8e3>   DW_AT_decl_file   : 4
    <8e4>   DW_AT_decl_line   : 1512
    <8e6>   DW_AT_decl_column : 3
    <8e6>   DW_AT_type        : <0x66b>
 <1><8ea>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <8eb>   DW_AT_encoding    : 7	(unsigned)
    <8eb>   DW_AT_byte_size   : 1
    <8eb>   DW_AT_type        : <0x31>
    <8ef>   DW_AT_decl_file   : 5
    <8f0>   DW_AT_decl_line   : 153
    <8f1>   DW_AT_decl_column : 1
    <8f2>   DW_AT_sibling     : <0x903>
 <2><8f6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8f7>   DW_AT_name        : (indirect string, offset: 0x91207): DISABLE
    <8fb>   DW_AT_const_value : 0
 <2><8fc>: Abbrev Number: 4 (DW_TAG_enumerator)
    <8fd>   DW_AT_name        : (indirect string, offset: 0xeb52f): ENABLE
    <901>   DW_AT_const_value : 1
 <2><902>: Abbrev Number: 0
 <1><903>: Abbrev Number: 3 (DW_TAG_typedef)
    <904>   DW_AT_name        : (indirect string, offset: 0xf1ac4): FunctionalState
    <908>   DW_AT_decl_file   : 5
    <909>   DW_AT_decl_line   : 156
    <90a>   DW_AT_decl_column : 3
    <90b>   DW_AT_type        : <0x8ea>
 <1><90f>: Abbrev Number: 5 (DW_TAG_base_type)
    <910>   DW_AT_byte_size   : 8
    <911>   DW_AT_encoding    : 4	(float)
    <912>   DW_AT_name        : (indirect string, offset: 0xc39ff): long double
 <1><916>: Abbrev Number: 27 (DW_TAG_pointer_type)
    <917>   DW_AT_byte_size   : 4
 <1><918>: Abbrev Number: 5 (DW_TAG_base_type)
    <919>   DW_AT_byte_size   : 1
    <91a>   DW_AT_encoding    : 8	(unsigned char)
    <91b>   DW_AT_name        : (indirect string, offset: 0xe2763): char
 <1><91f>: Abbrev Number: 5 (DW_TAG_base_type)
    <920>   DW_AT_byte_size   : 4
    <921>   DW_AT_encoding    : 4	(float)
    <922>   DW_AT_name        : (indirect string, offset: 0x714e): float
 <1><926>: Abbrev Number: 5 (DW_TAG_base_type)
    <927>   DW_AT_byte_size   : 8
    <928>   DW_AT_encoding    : 4	(float)
    <929>   DW_AT_name        : (indirect string, offset: 0x7c247): double
 <1><92d>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <92e>   DW_AT_encoding    : 7	(unsigned)
    <92e>   DW_AT_byte_size   : 1
    <92e>   DW_AT_type        : <0x31>
    <932>   DW_AT_decl_file   : 6
    <933>   DW_AT_decl_line   : 45
    <934>   DW_AT_decl_column : 3
    <935>   DW_AT_sibling     : <0x952>
 <2><939>: Abbrev Number: 4 (DW_TAG_enumerator)
    <93a>   DW_AT_name        : (indirect string, offset: 0x11912f): HAL_OK
    <93e>   DW_AT_const_value : 0
 <2><93f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <940>   DW_AT_name        : (indirect string, offset: 0x3b2f3): HAL_ERROR
    <944>   DW_AT_const_value : 1
 <2><945>: Abbrev Number: 4 (DW_TAG_enumerator)
    <946>   DW_AT_name        : (indirect string, offset: 0x16cdc): HAL_BUSY
    <94a>   DW_AT_const_value : 2
 <2><94b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <94c>   DW_AT_name        : (indirect string, offset: 0x20e5c): HAL_TIMEOUT
    <950>   DW_AT_const_value : 3
 <2><951>: Abbrev Number: 0
 <1><952>: Abbrev Number: 3 (DW_TAG_typedef)
    <953>   DW_AT_name        : (indirect string, offset: 0x11c717): HAL_StatusTypeDef
    <957>   DW_AT_decl_file   : 6
    <958>   DW_AT_decl_line   : 50
    <959>   DW_AT_decl_column : 5
    <95a>   DW_AT_type        : <0x92d>
 <1><95e>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <95f>   DW_AT_encoding    : 7	(unsigned)
    <95f>   DW_AT_byte_size   : 1
    <95f>   DW_AT_type        : <0x31>
    <963>   DW_AT_decl_file   : 6
    <964>   DW_AT_decl_line   : 56
    <965>   DW_AT_decl_column : 3
    <966>   DW_AT_sibling     : <0x977>
 <2><96a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <96b>   DW_AT_name        : (indirect string, offset: 0x717fd): HAL_UNLOCKED
    <96f>   DW_AT_const_value : 0
 <2><970>: Abbrev Number: 4 (DW_TAG_enumerator)
    <971>   DW_AT_name        : (indirect string, offset: 0x118440): HAL_LOCKED
    <975>   DW_AT_const_value : 1
 <2><976>: Abbrev Number: 0
 <1><977>: Abbrev Number: 3 (DW_TAG_typedef)
    <978>   DW_AT_name        : (indirect string, offset: 0x7b488): HAL_LockTypeDef
    <97c>   DW_AT_decl_file   : 6
    <97d>   DW_AT_decl_line   : 59
    <97e>   DW_AT_decl_column : 5
    <97f>   DW_AT_type        : <0x95e>
 <1><983>: Abbrev Number: 8 (DW_TAG_structure_type)
    <984>   DW_AT_byte_size   : 36
    <985>   DW_AT_decl_file   : 7
    <986>   DW_AT_decl_line   : 46
    <987>   DW_AT_decl_column : 9
    <987>   DW_AT_sibling     : <0xa01>
 <2><98b>: Abbrev Number: 2 (DW_TAG_member)
    <98c>   DW_AT_name        : (indirect string, offset: 0x150837): PLL2Source
    <990>   DW_AT_decl_file   : 7
    <991>   DW_AT_decl_line   : 48
    <992>   DW_AT_decl_column : 12
    <993>   DW_AT_type        : <0xa0>
    <997>   DW_AT_data_member_location: 0
 <2><998>: Abbrev Number: 2 (DW_TAG_member)
    <999>   DW_AT_name        : (indirect string, offset: 0x74482): PLL2M
    <99d>   DW_AT_decl_file   : 7
    <99e>   DW_AT_decl_line   : 51
    <99f>   DW_AT_decl_column : 12
    <9a0>   DW_AT_type        : <0xa0>
    <9a4>   DW_AT_data_member_location: 4
 <2><9a5>: Abbrev Number: 2 (DW_TAG_member)
    <9a6>   DW_AT_name        : (indirect string, offset: 0x74488): PLL2N
    <9aa>   DW_AT_decl_file   : 7
    <9ab>   DW_AT_decl_line   : 54
    <9ac>   DW_AT_decl_column : 12
    <9ad>   DW_AT_type        : <0xa0>
    <9b1>   DW_AT_data_member_location: 8
 <2><9b2>: Abbrev Number: 2 (DW_TAG_member)
    <9b3>   DW_AT_name        : (indirect string, offset: 0x7448e): PLL2P
    <9b7>   DW_AT_decl_file   : 7
    <9b8>   DW_AT_decl_line   : 57
    <9b9>   DW_AT_decl_column : 12
    <9ba>   DW_AT_type        : <0xa0>
    <9be>   DW_AT_data_member_location: 12
 <2><9bf>: Abbrev Number: 2 (DW_TAG_member)
    <9c0>   DW_AT_name        : (indirect string, offset: 0x74494): PLL2Q
    <9c4>   DW_AT_decl_file   : 7
    <9c5>   DW_AT_decl_line   : 60
    <9c6>   DW_AT_decl_column : 12
    <9c7>   DW_AT_type        : <0xa0>
    <9cb>   DW_AT_data_member_location: 16
 <2><9cc>: Abbrev Number: 2 (DW_TAG_member)
    <9cd>   DW_AT_name        : (indirect string, offset: 0x7449a): PLL2R
    <9d1>   DW_AT_decl_file   : 7
    <9d2>   DW_AT_decl_line   : 63
    <9d3>   DW_AT_decl_column : 12
    <9d4>   DW_AT_type        : <0xa0>
    <9d8>   DW_AT_data_member_location: 20
 <2><9d9>: Abbrev Number: 2 (DW_TAG_member)
    <9da>   DW_AT_name        : (indirect string, offset: 0x12bdd2): PLL2RGE
    <9de>   DW_AT_decl_file   : 7
    <9df>   DW_AT_decl_line   : 66
    <9e0>   DW_AT_decl_column : 12
    <9e1>   DW_AT_type        : <0xa0>
    <9e5>   DW_AT_data_member_location: 24
 <2><9e6>: Abbrev Number: 2 (DW_TAG_member)
    <9e7>   DW_AT_name        : (indirect string, offset: 0xc7bb): PLL2FRACN
    <9eb>   DW_AT_decl_file   : 7
    <9ec>   DW_AT_decl_line   : 69
    <9ed>   DW_AT_decl_column : 12
    <9ee>   DW_AT_type        : <0xa0>
    <9f2>   DW_AT_data_member_location: 28
 <2><9f3>: Abbrev Number: 2 (DW_TAG_member)
    <9f4>   DW_AT_name        : (indirect string, offset: 0x1057cd): PLL2ClockOut
    <9f8>   DW_AT_decl_file   : 7
    <9f9>   DW_AT_decl_line   : 72
    <9fa>   DW_AT_decl_column : 12
    <9fb>   DW_AT_type        : <0xa0>
    <9ff>   DW_AT_data_member_location: 32
 <2><a00>: Abbrev Number: 0
 <1><a01>: Abbrev Number: 3 (DW_TAG_typedef)
    <a02>   DW_AT_name        : (indirect string, offset: 0x115c19): RCC_PLL2InitTypeDef
    <a06>   DW_AT_decl_file   : 7
    <a07>   DW_AT_decl_line   : 74
    <a08>   DW_AT_decl_column : 3
    <a09>   DW_AT_type        : <0x983>
 <1><a0d>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a0e>   DW_AT_byte_size   : 36
    <a0f>   DW_AT_decl_file   : 7
    <a10>   DW_AT_decl_line   : 80
    <a11>   DW_AT_decl_column : 9
    <a11>   DW_AT_sibling     : <0xa8b>
 <2><a15>: Abbrev Number: 2 (DW_TAG_member)
    <a16>   DW_AT_name        : (indirect string, offset: 0x62851): PLL3Source
    <a1a>   DW_AT_decl_file   : 7
    <a1b>   DW_AT_decl_line   : 82
    <a1c>   DW_AT_decl_column : 12
    <a1d>   DW_AT_type        : <0xa0>
    <a21>   DW_AT_data_member_location: 0
 <2><a22>: Abbrev Number: 2 (DW_TAG_member)
    <a23>   DW_AT_name        : (indirect string, offset: 0x87d0d): PLL3M
    <a27>   DW_AT_decl_file   : 7
    <a28>   DW_AT_decl_line   : 85
    <a29>   DW_AT_decl_column : 12
    <a2a>   DW_AT_type        : <0xa0>
    <a2e>   DW_AT_data_member_location: 4
 <2><a2f>: Abbrev Number: 2 (DW_TAG_member)
    <a30>   DW_AT_name        : (indirect string, offset: 0x87d61): PLL3N
    <a34>   DW_AT_decl_file   : 7
    <a35>   DW_AT_decl_line   : 88
    <a36>   DW_AT_decl_column : 12
    <a37>   DW_AT_type        : <0xa0>
    <a3b>   DW_AT_data_member_location: 8
 <2><a3c>: Abbrev Number: 2 (DW_TAG_member)
    <a3d>   DW_AT_name        : (indirect string, offset: 0x7df56): PLL3P
    <a41>   DW_AT_decl_file   : 7
    <a42>   DW_AT_decl_line   : 91
    <a43>   DW_AT_decl_column : 12
    <a44>   DW_AT_type        : <0xa0>
    <a48>   DW_AT_data_member_location: 12
 <2><a49>: Abbrev Number: 2 (DW_TAG_member)
    <a4a>   DW_AT_name        : (indirect string, offset: 0x74918): PLL3Q
    <a4e>   DW_AT_decl_file   : 7
    <a4f>   DW_AT_decl_line   : 94
    <a50>   DW_AT_decl_column : 12
    <a51>   DW_AT_type        : <0xa0>
    <a55>   DW_AT_data_member_location: 16
 <2><a56>: Abbrev Number: 2 (DW_TAG_member)
    <a57>   DW_AT_name        : (indirect string, offset: 0x7491e): PLL3R
    <a5b>   DW_AT_decl_file   : 7
    <a5c>   DW_AT_decl_line   : 97
    <a5d>   DW_AT_decl_column : 12
    <a5e>   DW_AT_type        : <0xa0>
    <a62>   DW_AT_data_member_location: 20
 <2><a63>: Abbrev Number: 2 (DW_TAG_member)
    <a64>   DW_AT_name        : (indirect string, offset: 0x5a170): PLL3RGE
    <a68>   DW_AT_decl_file   : 7
    <a69>   DW_AT_decl_line   : 100
    <a6a>   DW_AT_decl_column : 12
    <a6b>   DW_AT_type        : <0xa0>
    <a6f>   DW_AT_data_member_location: 24
 <2><a70>: Abbrev Number: 2 (DW_TAG_member)
    <a71>   DW_AT_name        : (indirect string, offset: 0xba517): PLL3FRACN
    <a75>   DW_AT_decl_file   : 7
    <a76>   DW_AT_decl_line   : 103
    <a77>   DW_AT_decl_column : 12
    <a78>   DW_AT_type        : <0xa0>
    <a7c>   DW_AT_data_member_location: 28
 <2><a7d>: Abbrev Number: 2 (DW_TAG_member)
    <a7e>   DW_AT_name        : (indirect string, offset: 0xe9a3a): PLL3ClockOut
    <a82>   DW_AT_decl_file   : 7
    <a83>   DW_AT_decl_line   : 106
    <a84>   DW_AT_decl_column : 12
    <a85>   DW_AT_type        : <0xa0>
    <a89>   DW_AT_data_member_location: 32
 <2><a8a>: Abbrev Number: 0
 <1><a8b>: Abbrev Number: 3 (DW_TAG_typedef)
    <a8c>   DW_AT_name        : (indirect string, offset: 0x1ff24): RCC_PLL3InitTypeDef
    <a90>   DW_AT_decl_file   : 7
    <a91>   DW_AT_decl_line   : 108
    <a92>   DW_AT_decl_column : 3
    <a93>   DW_AT_type        : <0xa0d>
 <1><a97>: Abbrev Number: 8 (DW_TAG_structure_type)
    <a98>   DW_AT_byte_size   : 192
    <a99>   DW_AT_decl_file   : 7
    <a9a>   DW_AT_decl_line   : 144
    <a9b>   DW_AT_decl_column : 9
    <a9b>   DW_AT_sibling     : <0xc37>
 <2><a9f>: Abbrev Number: 2 (DW_TAG_member)
    <aa0>   DW_AT_name        : (indirect string, offset: 0x6eedc): PeriphClockSelection
    <aa4>   DW_AT_decl_file   : 7
    <aa5>   DW_AT_decl_line   : 146
    <aa6>   DW_AT_decl_column : 12
    <aa7>   DW_AT_type        : <0xb1>
    <aab>   DW_AT_data_member_location: 0
 <2><aac>: Abbrev Number: 2 (DW_TAG_member)
    <aad>   DW_AT_name        : (indirect string, offset: 0x28bae): PLL2
    <ab1>   DW_AT_decl_file   : 7
    <ab2>   DW_AT_decl_line   : 149
    <ab3>   DW_AT_decl_column : 23
    <ab4>   DW_AT_type        : <0xa01>
    <ab8>   DW_AT_data_member_location: 8
 <2><ab9>: Abbrev Number: 2 (DW_TAG_member)
    <aba>   DW_AT_name        : (indirect string, offset: 0x16153f): PLL3
    <abe>   DW_AT_decl_file   : 7
    <abf>   DW_AT_decl_line   : 153
    <ac0>   DW_AT_decl_column : 23
    <ac1>   DW_AT_type        : <0xa8b>
    <ac5>   DW_AT_data_member_location: 44
 <2><ac6>: Abbrev Number: 2 (DW_TAG_member)
    <ac7>   DW_AT_name        : (indirect string, offset: 0xa24d3): Usart1ClockSelection
    <acb>   DW_AT_decl_file   : 7
    <acc>   DW_AT_decl_line   : 157
    <acd>   DW_AT_decl_column : 12
    <ace>   DW_AT_type        : <0xa0>
    <ad2>   DW_AT_data_member_location: 80
 <2><ad3>: Abbrev Number: 2 (DW_TAG_member)
    <ad4>   DW_AT_name        : (indirect string, offset: 0xe6df9): Usart2ClockSelection
    <ad8>   DW_AT_decl_file   : 7
    <ad9>   DW_AT_decl_line   : 161
    <ada>   DW_AT_decl_column : 12
    <adb>   DW_AT_type        : <0xa0>
    <adf>   DW_AT_data_member_location: 84
 <2><ae0>: Abbrev Number: 2 (DW_TAG_member)
    <ae1>   DW_AT_name        : (indirect string, offset: 0x12c688): Usart3ClockSelection
    <ae5>   DW_AT_decl_file   : 7
    <ae6>   DW_AT_decl_line   : 165
    <ae7>   DW_AT_decl_column : 12
    <ae8>   DW_AT_type        : <0xa0>
    <aec>   DW_AT_data_member_location: 88
 <2><aed>: Abbrev Number: 2 (DW_TAG_member)
    <aee>   DW_AT_name        : (indirect string, offset: 0x140781): Uart4ClockSelection
    <af2>   DW_AT_decl_file   : 7
    <af3>   DW_AT_decl_line   : 168
    <af4>   DW_AT_decl_column : 12
    <af5>   DW_AT_type        : <0xa0>
    <af9>   DW_AT_data_member_location: 92
 <2><afa>: Abbrev Number: 2 (DW_TAG_member)
    <afb>   DW_AT_name        : (indirect string, offset: 0x31408): Uart5ClockSelection
    <aff>   DW_AT_decl_file   : 7
    <b00>   DW_AT_decl_line   : 171
    <b01>   DW_AT_decl_column : 12
    <b02>   DW_AT_type        : <0xa0>
    <b06>   DW_AT_data_member_location: 96
 <2><b07>: Abbrev Number: 2 (DW_TAG_member)
    <b08>   DW_AT_name        : (indirect string, offset: 0x712b9): Lpuart1ClockSelection
    <b0c>   DW_AT_decl_file   : 7
    <b0d>   DW_AT_decl_line   : 179
    <b0e>   DW_AT_decl_column : 12
    <b0f>   DW_AT_type        : <0xa0>
    <b13>   DW_AT_data_member_location: 100
 <2><b14>: Abbrev Number: 2 (DW_TAG_member)
    <b15>   DW_AT_name        : (indirect string, offset: 0x54e04): I2c1ClockSelection
    <b19>   DW_AT_decl_file   : 7
    <b1a>   DW_AT_decl_line   : 182
    <b1b>   DW_AT_decl_column : 12
    <b1c>   DW_AT_type        : <0xa0>
    <b20>   DW_AT_data_member_location: 104
 <2><b21>: Abbrev Number: 2 (DW_TAG_member)
    <b22>   DW_AT_name        : (indirect string, offset: 0xb40ae): I2c2ClockSelection
    <b26>   DW_AT_decl_file   : 7
    <b27>   DW_AT_decl_line   : 185
    <b28>   DW_AT_decl_column : 12
    <b29>   DW_AT_type        : <0xa0>
    <b2d>   DW_AT_data_member_location: 108
 <2><b2e>: Abbrev Number: 2 (DW_TAG_member)
    <b2f>   DW_AT_name        : (indirect string, offset: 0xfa3a5): I2c3ClockSelection
    <b33>   DW_AT_decl_file   : 7
    <b34>   DW_AT_decl_line   : 188
    <b35>   DW_AT_decl_column : 12
    <b36>   DW_AT_type        : <0xa0>
    <b3a>   DW_AT_data_member_location: 112
 <2><b3b>: Abbrev Number: 2 (DW_TAG_member)
    <b3c>   DW_AT_name        : (indirect string, offset: 0x13d85a): I2c4ClockSelection
    <b40>   DW_AT_decl_file   : 7
    <b41>   DW_AT_decl_line   : 191
    <b42>   DW_AT_decl_column : 12
    <b43>   DW_AT_type        : <0xa0>
    <b47>   DW_AT_data_member_location: 116
 <2><b48>: Abbrev Number: 2 (DW_TAG_member)
    <b49>   DW_AT_name        : (indirect string, offset: 0x8f772): Lptim1ClockSelection
    <b4d>   DW_AT_decl_file   : 7
    <b4e>   DW_AT_decl_line   : 204
    <b4f>   DW_AT_decl_column : 12
    <b50>   DW_AT_type        : <0xa0>
    <b54>   DW_AT_data_member_location: 120
 <2><b55>: Abbrev Number: 2 (DW_TAG_member)
    <b56>   DW_AT_name        : (indirect string, offset: 0xd45e1): Lptim2ClockSelection
    <b5a>   DW_AT_decl_file   : 7
    <b5b>   DW_AT_decl_line   : 207
    <b5c>   DW_AT_decl_column : 12
    <b5d>   DW_AT_type        : <0xa0>
    <b61>   DW_AT_data_member_location: 124
 <2><b62>: Abbrev Number: 2 (DW_TAG_member)
    <b63>   DW_AT_name        : (indirect string, offset: 0x11f433): Lptim34ClockSelection
    <b67>   DW_AT_decl_file   : 7
    <b68>   DW_AT_decl_line   : 210
    <b69>   DW_AT_decl_column : 12
    <b6a>   DW_AT_type        : <0xa0>
    <b6e>   DW_AT_data_member_location: 128
 <2><b6f>: Abbrev Number: 2 (DW_TAG_member)
    <b70>   DW_AT_name        : (indirect string, offset: 0x131293): Fdcan1ClockSelection
    <b74>   DW_AT_decl_file   : 7
    <b75>   DW_AT_decl_line   : 213
    <b76>   DW_AT_decl_column : 12
    <b77>   DW_AT_type        : <0xa0>
    <b7b>   DW_AT_data_member_location: 132
 <2><b7c>: Abbrev Number: 2 (DW_TAG_member)
    <b7d>   DW_AT_name        : (indirect string, offset: 0x14a4be): Mdf1ClockSelection
    <b81>   DW_AT_decl_file   : 7
    <b82>   DW_AT_decl_line   : 216
    <b83>   DW_AT_decl_column : 12
    <b84>   DW_AT_type        : <0xa0>
    <b88>   DW_AT_data_member_location: 136
 <2><b89>: Abbrev Number: 2 (DW_TAG_member)
    <b8a>   DW_AT_name        : (indirect string, offset: 0x77f08): Adf1ClockSelection
    <b8e>   DW_AT_decl_file   : 7
    <b8f>   DW_AT_decl_line   : 219
    <b90>   DW_AT_decl_column : 12
    <b91>   DW_AT_type        : <0xa0>
    <b95>   DW_AT_data_member_location: 140
 <2><b96>: Abbrev Number: 2 (DW_TAG_member)
    <b97>   DW_AT_name        : (indirect string, offset: 0xcf2ed): Sai1ClockSelection
    <b9b>   DW_AT_decl_file   : 7
    <b9c>   DW_AT_decl_line   : 222
    <b9d>   DW_AT_decl_column : 12
    <b9e>   DW_AT_type        : <0xa0>
    <ba2>   DW_AT_data_member_location: 144
 <2><ba3>: Abbrev Number: 2 (DW_TAG_member)
    <ba4>   DW_AT_name        : (indirect string, offset: 0x114826): Sai2ClockSelection
    <ba8>   DW_AT_decl_file   : 7
    <ba9>   DW_AT_decl_line   : 226
    <baa>   DW_AT_decl_column : 12
    <bab>   DW_AT_type        : <0xa0>
    <baf>   DW_AT_data_member_location: 148
 <2><bb0>: Abbrev Number: 2 (DW_TAG_member)
    <bb1>   DW_AT_name        : (indirect string, offset: 0xbf497): RngClockSelection
    <bb5>   DW_AT_decl_file   : 7
    <bb6>   DW_AT_decl_line   : 230
    <bb7>   DW_AT_decl_column : 12
    <bb8>   DW_AT_type        : <0xa0>
    <bbc>   DW_AT_data_member_location: 152
 <2><bbd>: Abbrev Number: 2 (DW_TAG_member)
    <bbe>   DW_AT_name        : (indirect string, offset: 0x10011c): IclkClockSelection
    <bc2>   DW_AT_decl_file   : 7
    <bc3>   DW_AT_decl_line   : 238
    <bc4>   DW_AT_decl_column : 12
    <bc5>   DW_AT_type        : <0xa0>
    <bc9>   DW_AT_data_member_location: 156
 <2><bca>: Abbrev Number: 2 (DW_TAG_member)
    <bcb>   DW_AT_name        : (indirect string, offset: 0x8bcb3): SdmmcClockSelection
    <bcf>   DW_AT_decl_file   : 7
    <bd0>   DW_AT_decl_line   : 241
    <bd1>   DW_AT_decl_column : 12
    <bd2>   DW_AT_type        : <0xa0>
    <bd6>   DW_AT_data_member_location: 160
 <2><bd7>: Abbrev Number: 2 (DW_TAG_member)
    <bd8>   DW_AT_name        : (indirect string, offset: 0xbbd33): AdcDacClockSelection
    <bdc>   DW_AT_decl_file   : 7
    <bdd>   DW_AT_decl_line   : 244
    <bde>   DW_AT_decl_column : 12
    <bdf>   DW_AT_type        : <0xa0>
    <be3>   DW_AT_data_member_location: 164
 <2><be4>: Abbrev Number: 2 (DW_TAG_member)
    <be5>   DW_AT_name        : (indirect string, offset: 0xa1040): Dac1ClockSelection
    <be9>   DW_AT_decl_file   : 7
    <bea>   DW_AT_decl_line   : 247
    <beb>   DW_AT_decl_column : 12
    <bec>   DW_AT_type        : <0xa0>
    <bf0>   DW_AT_data_member_location: 168
 <2><bf1>: Abbrev Number: 2 (DW_TAG_member)
    <bf2>   DW_AT_name        : (indirect string, offset: 0x795ac): OspiClockSelection
    <bf6>   DW_AT_decl_file   : 7
    <bf7>   DW_AT_decl_line   : 250
    <bf8>   DW_AT_decl_column : 12
    <bf9>   DW_AT_type        : <0xa0>
    <bfd>   DW_AT_data_member_location: 172
 <2><bfe>: Abbrev Number: 1 (DW_TAG_member)
    <bff>   DW_AT_name        : (indirect string, offset: 0x7b7cf): Spi1ClockSelection
    <c03>   DW_AT_decl_file   : 7
    <c04>   DW_AT_decl_line   : 258
    <c06>   DW_AT_decl_column : 12
    <c07>   DW_AT_type        : <0xa0>
    <c0b>   DW_AT_data_member_location: 176
 <2><c0c>: Abbrev Number: 1 (DW_TAG_member)
    <c0d>   DW_AT_name        : (indirect string, offset: 0x94ee7): Spi2ClockSelection
    <c11>   DW_AT_decl_file   : 7
    <c12>   DW_AT_decl_line   : 261
    <c14>   DW_AT_decl_column : 12
    <c15>   DW_AT_type        : <0xa0>
    <c19>   DW_AT_data_member_location: 180
 <2><c1a>: Abbrev Number: 1 (DW_TAG_member)
    <c1b>   DW_AT_name        : (indirect string, offset: 0xda045): Spi3ClockSelection
    <c1f>   DW_AT_decl_file   : 7
    <c20>   DW_AT_decl_line   : 264
    <c22>   DW_AT_decl_column : 12
    <c23>   DW_AT_type        : <0xa0>
    <c27>   DW_AT_data_member_location: 184
 <2><c28>: Abbrev Number: 1 (DW_TAG_member)
    <c29>   DW_AT_name        : (indirect string, offset: 0xad100): RTCClockSelection
    <c2d>   DW_AT_decl_file   : 7
    <c2e>   DW_AT_decl_line   : 267
    <c30>   DW_AT_decl_column : 12
    <c31>   DW_AT_type        : <0xa0>
    <c35>   DW_AT_data_member_location: 188
 <2><c36>: Abbrev Number: 0
 <1><c37>: Abbrev Number: 9 (DW_TAG_typedef)
    <c38>   DW_AT_name        : (indirect string, offset: 0x80b15): RCC_PeriphCLKInitTypeDef
    <c3c>   DW_AT_decl_file   : 7
    <c3d>   DW_AT_decl_line   : 285
    <c3f>   DW_AT_decl_column : 3
    <c3f>   DW_AT_type        : <0xa97>
 <1><c43>: Abbrev Number: 18 (DW_TAG_const_type)
    <c44>   DW_AT_type        : <0xc37>
 <1><c48>: Abbrev Number: 8 (DW_TAG_structure_type)
    <c49>   DW_AT_byte_size   : 20
    <c4a>   DW_AT_decl_file   : 8
    <c4b>   DW_AT_decl_line   : 47
    <c4c>   DW_AT_decl_column : 9
    <c4c>   DW_AT_sibling     : <0xc92>
 <2><c50>: Abbrev Number: 28 (DW_TAG_member)
    <c51>   DW_AT_name        : Pin
    <c55>   DW_AT_decl_file   : 8
    <c56>   DW_AT_decl_line   : 49
    <c57>   DW_AT_decl_column : 12
    <c58>   DW_AT_type        : <0xa0>
    <c5c>   DW_AT_data_member_location: 0
 <2><c5d>: Abbrev Number: 2 (DW_TAG_member)
    <c5e>   DW_AT_name        : (indirect string, offset: 0x15ffd8): Mode
    <c62>   DW_AT_decl_file   : 8
    <c63>   DW_AT_decl_line   : 52
    <c64>   DW_AT_decl_column : 12
    <c65>   DW_AT_type        : <0xa0>
    <c69>   DW_AT_data_member_location: 4
 <2><c6a>: Abbrev Number: 2 (DW_TAG_member)
    <c6b>   DW_AT_name        : (indirect string, offset: 0x10dd61): Pull
    <c6f>   DW_AT_decl_file   : 8
    <c70>   DW_AT_decl_line   : 55
    <c71>   DW_AT_decl_column : 12
    <c72>   DW_AT_type        : <0xa0>
    <c76>   DW_AT_data_member_location: 8
 <2><c77>: Abbrev Number: 2 (DW_TAG_member)
    <c78>   DW_AT_name        : (indirect string, offset: 0x5b30): Speed
    <c7c>   DW_AT_decl_file   : 8
    <c7d>   DW_AT_decl_line   : 58
    <c7e>   DW_AT_decl_column : 12
    <c7f>   DW_AT_type        : <0xa0>
    <c83>   DW_AT_data_member_location: 12
 <2><c84>: Abbrev Number: 2 (DW_TAG_member)
    <c85>   DW_AT_name        : (indirect string, offset: 0x14551c): Alternate
    <c89>   DW_AT_decl_file   : 8
    <c8a>   DW_AT_decl_line   : 61
    <c8b>   DW_AT_decl_column : 12
    <c8c>   DW_AT_type        : <0xa0>
    <c90>   DW_AT_data_member_location: 16
 <2><c91>: Abbrev Number: 0
 <1><c92>: Abbrev Number: 3 (DW_TAG_typedef)
    <c93>   DW_AT_name        : (indirect string, offset: 0x6fc24): GPIO_InitTypeDef
    <c97>   DW_AT_decl_file   : 8
    <c98>   DW_AT_decl_line   : 63
    <c99>   DW_AT_decl_column : 3
    <c9a>   DW_AT_type        : <0xc48>
 <1><c9e>: Abbrev Number: 18 (DW_TAG_const_type)
    <c9f>   DW_AT_type        : <0xc92>
 <1><ca3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ca4>   DW_AT_byte_size   : 4
    <ca4>   DW_AT_type        : <0x2b0>
 <1><ca8>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ca9>   DW_AT_byte_size   : 52
    <caa>   DW_AT_decl_file   : 9
    <cab>   DW_AT_decl_line   : 49
    <cac>   DW_AT_decl_column : 9
    <cac>   DW_AT_sibling     : <0xd5a>
 <2><cb0>: Abbrev Number: 2 (DW_TAG_member)
    <cb1>   DW_AT_name        : (indirect string, offset: 0xcf40d): Request
    <cb5>   DW_AT_decl_file   : 9
    <cb6>   DW_AT_decl_line   : 51
    <cb7>   DW_AT_decl_column : 12
    <cb8>   DW_AT_type        : <0xa0>
    <cbc>   DW_AT_data_member_location: 0
 <2><cbd>: Abbrev Number: 2 (DW_TAG_member)
    <cbe>   DW_AT_name        : (indirect string, offset: 0xcf408): BlkHWRequest
    <cc2>   DW_AT_decl_file   : 9
    <cc3>   DW_AT_decl_line   : 54
    <cc4>   DW_AT_decl_column : 12
    <cc5>   DW_AT_type        : <0xa0>
    <cc9>   DW_AT_data_member_location: 4
 <2><cca>: Abbrev Number: 2 (DW_TAG_member)
    <ccb>   DW_AT_name        : (indirect string, offset: 0x15e933): Direction
    <ccf>   DW_AT_decl_file   : 9
    <cd0>   DW_AT_decl_line   : 58
    <cd1>   DW_AT_decl_column : 12
    <cd2>   DW_AT_type        : <0xa0>
    <cd6>   DW_AT_data_member_location: 8
 <2><cd7>: Abbrev Number: 2 (DW_TAG_member)
    <cd8>   DW_AT_name        : (indirect string, offset: 0x125bab): SrcInc
    <cdc>   DW_AT_decl_file   : 9
    <cdd>   DW_AT_decl_line   : 61
    <cde>   DW_AT_decl_column : 12
    <cdf>   DW_AT_type        : <0xa0>
    <ce3>   DW_AT_data_member_location: 12
 <2><ce4>: Abbrev Number: 2 (DW_TAG_member)
    <ce5>   DW_AT_name        : (indirect string, offset: 0x15271b): DestInc
    <ce9>   DW_AT_decl_file   : 9
    <cea>   DW_AT_decl_line   : 64
    <ceb>   DW_AT_decl_column : 12
    <cec>   DW_AT_type        : <0xa0>
    <cf0>   DW_AT_data_member_location: 16
 <2><cf1>: Abbrev Number: 2 (DW_TAG_member)
    <cf2>   DW_AT_name        : (indirect string, offset: 0x7f8c): SrcDataWidth
    <cf6>   DW_AT_decl_file   : 9
    <cf7>   DW_AT_decl_line   : 67
    <cf8>   DW_AT_decl_column : 12
    <cf9>   DW_AT_type        : <0xa0>
    <cfd>   DW_AT_data_member_location: 20
 <2><cfe>: Abbrev Number: 2 (DW_TAG_member)
    <cff>   DW_AT_name        : (indirect string, offset: 0x9364c): DestDataWidth
    <d03>   DW_AT_decl_file   : 9
    <d04>   DW_AT_decl_line   : 70
    <d05>   DW_AT_decl_column : 12
    <d06>   DW_AT_type        : <0xa0>
    <d0a>   DW_AT_data_member_location: 24
 <2><d0b>: Abbrev Number: 2 (DW_TAG_member)
    <d0c>   DW_AT_name        : (indirect string, offset: 0x15d2a3): Priority
    <d10>   DW_AT_decl_file   : 9
    <d11>   DW_AT_decl_line   : 73
    <d12>   DW_AT_decl_column : 12
    <d13>   DW_AT_type        : <0xa0>
    <d17>   DW_AT_data_member_location: 28
 <2><d18>: Abbrev Number: 2 (DW_TAG_member)
    <d19>   DW_AT_name        : (indirect string, offset: 0x128d11): SrcBurstLength
    <d1d>   DW_AT_decl_file   : 9
    <d1e>   DW_AT_decl_line   : 76
    <d1f>   DW_AT_decl_column : 12
    <d20>   DW_AT_type        : <0xa0>
    <d24>   DW_AT_data_member_location: 32
 <2><d25>: Abbrev Number: 2 (DW_TAG_member)
    <d26>   DW_AT_name        : (indirect string, offset: 0x141a72): DestBurstLength
    <d2a>   DW_AT_decl_file   : 9
    <d2b>   DW_AT_decl_line   : 80
    <d2c>   DW_AT_decl_column : 12
    <d2d>   DW_AT_type        : <0xa0>
    <d31>   DW_AT_data_member_location: 36
 <2><d32>: Abbrev Number: 2 (DW_TAG_member)
    <d33>   DW_AT_name        : (indirect string, offset: 0xc7da3): TransferAllocatedPort
    <d37>   DW_AT_decl_file   : 9
    <d38>   DW_AT_decl_line   : 84
    <d39>   DW_AT_decl_column : 12
    <d3a>   DW_AT_type        : <0xa0>
    <d3e>   DW_AT_data_member_location: 40
 <2><d3f>: Abbrev Number: 2 (DW_TAG_member)
    <d40>   DW_AT_name        : (indirect string, offset: 0xe8348): TransferEventMode
    <d44>   DW_AT_decl_file   : 9
    <d45>   DW_AT_decl_line   : 87
    <d46>   DW_AT_decl_column : 12
    <d47>   DW_AT_type        : <0xa0>
    <d4b>   DW_AT_data_member_location: 44
 <2><d4c>: Abbrev Number: 2 (DW_TAG_member)
    <d4d>   DW_AT_name        : (indirect string, offset: 0x15ffd8): Mode
    <d51>   DW_AT_decl_file   : 9
    <d52>   DW_AT_decl_line   : 90
    <d53>   DW_AT_decl_column : 12
    <d54>   DW_AT_type        : <0xa0>
    <d58>   DW_AT_data_member_location: 48
 <2><d59>: Abbrev Number: 0
 <1><d5a>: Abbrev Number: 3 (DW_TAG_typedef)
    <d5b>   DW_AT_name        : (indirect string, offset: 0xe1846): DMA_InitTypeDef
    <d5f>   DW_AT_decl_file   : 9
    <d60>   DW_AT_decl_line   : 93
    <d61>   DW_AT_decl_column : 3
    <d62>   DW_AT_type        : <0xca8>
 <1><d66>: Abbrev Number: 8 (DW_TAG_structure_type)
    <d67>   DW_AT_byte_size   : 20
    <d68>   DW_AT_decl_file   : 9
    <d69>   DW_AT_decl_line   : 98
    <d6a>   DW_AT_decl_column : 9
    <d6a>   DW_AT_sibling     : <0xdb0>
 <2><d6e>: Abbrev Number: 2 (DW_TAG_member)
    <d6f>   DW_AT_name        : (indirect string, offset: 0x15d2a3): Priority
    <d73>   DW_AT_decl_file   : 9
    <d74>   DW_AT_decl_line   : 100
    <d75>   DW_AT_decl_column : 12
    <d76>   DW_AT_type        : <0xa0>
    <d7a>   DW_AT_data_member_location: 0
 <2><d7b>: Abbrev Number: 2 (DW_TAG_member)
    <d7c>   DW_AT_name        : (indirect string, offset: 0x149391): LinkStepMode
    <d80>   DW_AT_decl_file   : 9
    <d81>   DW_AT_decl_line   : 103
    <d82>   DW_AT_decl_column : 12
    <d83>   DW_AT_type        : <0xa0>
    <d87>   DW_AT_data_member_location: 4
 <2><d88>: Abbrev Number: 2 (DW_TAG_member)
    <d89>   DW_AT_name        : (indirect string, offset: 0x50c7d): LinkAllocatedPort
    <d8d>   DW_AT_decl_file   : 9
    <d8e>   DW_AT_decl_line   : 106
    <d8f>   DW_AT_decl_column : 12
    <d90>   DW_AT_type        : <0xa0>
    <d94>   DW_AT_data_member_location: 8
 <2><d95>: Abbrev Number: 2 (DW_TAG_member)
    <d96>   DW_AT_name        : (indirect string, offset: 0xe8348): TransferEventMode
    <d9a>   DW_AT_decl_file   : 9
    <d9b>   DW_AT_decl_line   : 109
    <d9c>   DW_AT_decl_column : 12
    <d9d>   DW_AT_type        : <0xa0>
    <da1>   DW_AT_data_member_location: 12
 <2><da2>: Abbrev Number: 2 (DW_TAG_member)
    <da3>   DW_AT_name        : (indirect string, offset: 0xbd91d): LinkedListMode
    <da7>   DW_AT_decl_file   : 9
    <da8>   DW_AT_decl_line   : 112
    <da9>   DW_AT_decl_column : 12
    <daa>   DW_AT_type        : <0xa0>
    <dae>   DW_AT_data_member_location: 16
 <2><daf>: Abbrev Number: 0
 <1><db0>: Abbrev Number: 3 (DW_TAG_typedef)
    <db1>   DW_AT_name        : (indirect string, offset: 0x4ef8e): DMA_InitLinkedListTypeDef
    <db5>   DW_AT_decl_file   : 9
    <db6>   DW_AT_decl_line   : 115
    <db7>   DW_AT_decl_column : 3
    <db8>   DW_AT_type        : <0xd66>
 <1><dbc>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <dbd>   DW_AT_encoding    : 7	(unsigned)
    <dbd>   DW_AT_byte_size   : 1
    <dbd>   DW_AT_type        : <0x31>
    <dc1>   DW_AT_decl_file   : 9
    <dc2>   DW_AT_decl_line   : 121
    <dc3>   DW_AT_decl_column : 1
    <dc4>   DW_AT_sibling     : <0xded>
 <2><dc8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc9>   DW_AT_name        : (indirect string, offset: 0x498bb): HAL_DMA_STATE_RESET
    <dcd>   DW_AT_const_value : 0
 <2><dce>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dcf>   DW_AT_name        : (indirect string, offset: 0x24db6): HAL_DMA_STATE_READY
    <dd3>   DW_AT_const_value : 1
 <2><dd4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dd5>   DW_AT_name        : (indirect string, offset: 0xa6e65): HAL_DMA_STATE_BUSY
    <dd9>   DW_AT_const_value : 2
 <2><dda>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ddb>   DW_AT_name        : (indirect string, offset: 0xdfa78): HAL_DMA_STATE_ERROR
    <ddf>   DW_AT_const_value : 3
 <2><de0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <de1>   DW_AT_name        : (indirect string, offset: 0x110851): HAL_DMA_STATE_ABORT
    <de5>   DW_AT_const_value : 4
 <2><de6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <de7>   DW_AT_name        : (indirect string, offset: 0x5b513): HAL_DMA_STATE_SUSPEND
    <deb>   DW_AT_const_value : 5
 <2><dec>: Abbrev Number: 0
 <1><ded>: Abbrev Number: 3 (DW_TAG_typedef)
    <dee>   DW_AT_name        : (indirect string, offset: 0x33438): HAL_DMA_StateTypeDef
    <df2>   DW_AT_decl_file   : 9
    <df3>   DW_AT_decl_line   : 129
    <df4>   DW_AT_decl_column : 3
    <df5>   DW_AT_type        : <0xdbc>
 <1><df9>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <dfa>   DW_AT_type        : <0xded>
 <1><dfe>: Abbrev Number: 19 (DW_TAG_structure_type)
    <dff>   DW_AT_name        : (indirect string, offset: 0xa1a96): __DMA_HandleTypeDef
    <e03>   DW_AT_byte_size   : 120
    <e04>   DW_AT_decl_file   : 9
    <e05>   DW_AT_decl_line   : 158
    <e06>   DW_AT_decl_column : 16
    <e06>   DW_AT_sibling     : <0xec1>
 <2><e0a>: Abbrev Number: 2 (DW_TAG_member)
    <e0b>   DW_AT_name        : (indirect string, offset: 0x62661): Instance
    <e0f>   DW_AT_decl_file   : 9
    <e10>   DW_AT_decl_line   : 160
    <e11>   DW_AT_decl_column : 30
    <e12>   DW_AT_type        : <0xec1>
    <e16>   DW_AT_data_member_location: 0
 <2><e17>: Abbrev Number: 2 (DW_TAG_member)
    <e18>   DW_AT_name        : (indirect string, offset: 0x161d83): Init
    <e1c>   DW_AT_decl_file   : 9
    <e1d>   DW_AT_decl_line   : 162
    <e1e>   DW_AT_decl_column : 29
    <e1f>   DW_AT_type        : <0xd5a>
    <e23>   DW_AT_data_member_location: 4
 <2><e24>: Abbrev Number: 2 (DW_TAG_member)
    <e25>   DW_AT_name        : (indirect string, offset: 0x316c2): InitLinkedList
    <e29>   DW_AT_decl_file   : 9
    <e2a>   DW_AT_decl_line   : 164
    <e2b>   DW_AT_decl_column : 29
    <e2c>   DW_AT_type        : <0xdb0>
    <e30>   DW_AT_data_member_location: 56
 <2><e31>: Abbrev Number: 2 (DW_TAG_member)
    <e32>   DW_AT_name        : (indirect string, offset: 0x15beac): Lock
    <e36>   DW_AT_decl_file   : 9
    <e37>   DW_AT_decl_line   : 166
    <e38>   DW_AT_decl_column : 29
    <e39>   DW_AT_type        : <0x977>
    <e3d>   DW_AT_data_member_location: 76
 <2><e3e>: Abbrev Number: 2 (DW_TAG_member)
    <e3f>   DW_AT_name        : (indirect string, offset: 0x15ffd8): Mode
    <e43>   DW_AT_decl_file   : 9
    <e44>   DW_AT_decl_line   : 168
    <e45>   DW_AT_decl_column : 29
    <e46>   DW_AT_type        : <0xa0>
    <e4a>   DW_AT_data_member_location: 80
 <2><e4b>: Abbrev Number: 2 (DW_TAG_member)
    <e4c>   DW_AT_name        : (indirect string, offset: 0x15b96c): State
    <e50>   DW_AT_decl_file   : 9
    <e51>   DW_AT_decl_line   : 170
    <e52>   DW_AT_decl_column : 29
    <e53>   DW_AT_type        : <0xdf9>
    <e57>   DW_AT_data_member_location: 84
 <2><e58>: Abbrev Number: 2 (DW_TAG_member)
    <e59>   DW_AT_name        : (indirect string, offset: 0x145d7d): ErrorCode
    <e5d>   DW_AT_decl_file   : 9
    <e5e>   DW_AT_decl_line   : 172
    <e5f>   DW_AT_decl_column : 29
    <e60>   DW_AT_type        : <0xac>
    <e64>   DW_AT_data_member_location: 88
 <2><e65>: Abbrev Number: 2 (DW_TAG_member)
    <e66>   DW_AT_name        : (indirect string, offset: 0xe2b04): Parent
    <e6a>   DW_AT_decl_file   : 9
    <e6b>   DW_AT_decl_line   : 174
    <e6c>   DW_AT_decl_column : 30
    <e6d>   DW_AT_type        : <0x916>
    <e71>   DW_AT_data_member_location: 92
 <2><e72>: Abbrev Number: 2 (DW_TAG_member)
    <e73>   DW_AT_name        : (indirect string, offset: 0x95f39): XferCpltCallback
    <e77>   DW_AT_decl_file   : 9
    <e78>   DW_AT_decl_line   : 176
    <e79>   DW_AT_decl_column : 11
    <e7a>   DW_AT_type        : <0xed6>
    <e7e>   DW_AT_data_member_location: 96
 <2><e7f>: Abbrev Number: 2 (DW_TAG_member)
    <e80>   DW_AT_name        : (indirect string, offset: 0x682fe): XferHalfCpltCallback
    <e84>   DW_AT_decl_file   : 9
    <e85>   DW_AT_decl_line   : 178
    <e86>   DW_AT_decl_column : 11
    <e87>   DW_AT_type        : <0xed6>
    <e8b>   DW_AT_data_member_location: 100
 <2><e8c>: Abbrev Number: 2 (DW_TAG_member)
    <e8d>   DW_AT_name        : (indirect string, offset: 0x11465): XferErrorCallback
    <e91>   DW_AT_decl_file   : 9
    <e92>   DW_AT_decl_line   : 180
    <e93>   DW_AT_decl_column : 11
    <e94>   DW_AT_type        : <0xed6>
    <e98>   DW_AT_data_member_location: 104
 <2><e99>: Abbrev Number: 2 (DW_TAG_member)
    <e9a>   DW_AT_name        : (indirect string, offset: 0x6066): XferAbortCallback
    <e9e>   DW_AT_decl_file   : 9
    <e9f>   DW_AT_decl_line   : 182
    <ea0>   DW_AT_decl_column : 11
    <ea1>   DW_AT_type        : <0xed6>
    <ea5>   DW_AT_data_member_location: 108
 <2><ea6>: Abbrev Number: 2 (DW_TAG_member)
    <ea7>   DW_AT_name        : (indirect string, offset: 0x7744d): XferSuspendCallback
    <eab>   DW_AT_decl_file   : 9
    <eac>   DW_AT_decl_line   : 184
    <ead>   DW_AT_decl_column : 11
    <eae>   DW_AT_type        : <0xed6>
    <eb2>   DW_AT_data_member_location: 112
 <2><eb3>: Abbrev Number: 2 (DW_TAG_member)
    <eb4>   DW_AT_name        : (indirect string, offset: 0x81f36): LinkedListQueue
    <eb8>   DW_AT_decl_file   : 9
    <eb9>   DW_AT_decl_line   : 186
    <eba>   DW_AT_decl_column : 31
    <ebb>   DW_AT_type        : <0xf36>
    <ebf>   DW_AT_data_member_location: 116
 <2><ec0>: Abbrev Number: 0
 <1><ec1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ec2>   DW_AT_byte_size   : 4
    <ec2>   DW_AT_type        : <0x1ea>
 <1><ec6>: Abbrev Number: 29 (DW_TAG_subroutine_type)
    <ec7>   DW_AT_prototyped  : 1
    <ec7>   DW_AT_sibling     : <0xed1>
 <2><ecb>: Abbrev Number: 12 (DW_TAG_formal_parameter)
    <ecc>   DW_AT_type        : <0xed1>
 <2><ed0>: Abbrev Number: 0
 <1><ed1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ed2>   DW_AT_byte_size   : 4
    <ed2>   DW_AT_type        : <0xdfe>
 <1><ed6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ed7>   DW_AT_byte_size   : 4
    <ed7>   DW_AT_type        : <0xec6>
 <1><edb>: Abbrev Number: 19 (DW_TAG_structure_type)
    <edc>   DW_AT_name        : (indirect string, offset: 0x29e80): __DMA_QListTypeDef
    <ee0>   DW_AT_byte_size   : 24
    <ee1>   DW_AT_decl_file   : 10
    <ee2>   DW_AT_decl_line   : 170
    <ee3>   DW_AT_decl_column : 16
    <ee3>   DW_AT_sibling     : <0xf36>
 <2><ee7>: Abbrev Number: 2 (DW_TAG_member)
    <ee8>   DW_AT_name        : (indirect string, offset: 0x15d85b): Head
    <eec>   DW_AT_decl_file   : 10
    <eed>   DW_AT_decl_line   : 172
    <eee>   DW_AT_decl_column : 35
    <eef>   DW_AT_type        : <0xfa6>
    <ef3>   DW_AT_data_member_location: 0
 <2><ef4>: Abbrev Number: 2 (DW_TAG_member)
    <ef5>   DW_AT_name        : (indirect string, offset: 0x15dd49): FirstCircularNode
    <ef9>   DW_AT_decl_file   : 10
    <efa>   DW_AT_decl_line   : 174
    <efb>   DW_AT_decl_column : 35
    <efc>   DW_AT_type        : <0xfa6>
    <f00>   DW_AT_data_member_location: 4
 <2><f01>: Abbrev Number: 2 (DW_TAG_member)
    <f02>   DW_AT_name        : (indirect string, offset: 0xe2fce): NodeNumber
    <f06>   DW_AT_decl_file   : 10
    <f07>   DW_AT_decl_line   : 176
    <f08>   DW_AT_decl_column : 34
    <f09>   DW_AT_type        : <0xa0>
    <f0d>   DW_AT_data_member_location: 8
 <2><f0e>: Abbrev Number: 2 (DW_TAG_member)
    <f0f>   DW_AT_name        : (indirect string, offset: 0x15b96c): State
    <f13>   DW_AT_decl_file   : 10
    <f14>   DW_AT_decl_line   : 178
    <f15>   DW_AT_decl_column : 34
    <f16>   DW_AT_type        : <0xf72>
    <f1a>   DW_AT_data_member_location: 12
 <2><f1b>: Abbrev Number: 2 (DW_TAG_member)
    <f1c>   DW_AT_name        : (indirect string, offset: 0x145d7d): ErrorCode
    <f20>   DW_AT_decl_file   : 10
    <f21>   DW_AT_decl_line   : 180
    <f22>   DW_AT_decl_column : 34
    <f23>   DW_AT_type        : <0xac>
    <f27>   DW_AT_data_member_location: 16
 <2><f28>: Abbrev Number: 2 (DW_TAG_member)
    <f29>   DW_AT_name        : (indirect string, offset: 0x15fec3): Type
    <f2d>   DW_AT_decl_file   : 10
    <f2e>   DW_AT_decl_line   : 182
    <f2f>   DW_AT_decl_column : 34
    <f30>   DW_AT_type        : <0xac>
    <f34>   DW_AT_data_member_location: 20
 <2><f35>: Abbrev Number: 0
 <1><f36>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <f37>   DW_AT_byte_size   : 4
    <f37>   DW_AT_type        : <0xedb>
 <1><f3b>: Abbrev Number: 3 (DW_TAG_typedef)
    <f3c>   DW_AT_name        : (indirect string, offset: 0xa1a98): DMA_HandleTypeDef
    <f40>   DW_AT_decl_file   : 9
    <f41>   DW_AT_decl_line   : 188
    <f42>   DW_AT_decl_column : 3
    <f43>   DW_AT_type        : <0xdfe>
 <1><f47>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <f48>   DW_AT_encoding    : 7	(unsigned)
    <f48>   DW_AT_byte_size   : 1
    <f48>   DW_AT_type        : <0x31>
    <f4c>   DW_AT_decl_file   : 10
    <f4d>   DW_AT_decl_line   : 123
    <f4e>   DW_AT_decl_column : 1
    <f4f>   DW_AT_sibling     : <0xf66>
 <2><f53>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f54>   DW_AT_name        : (indirect string, offset: 0xb07c3): HAL_DMA_QUEUE_STATE_RESET
    <f58>   DW_AT_const_value : 0
 <2><f59>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f5a>   DW_AT_name        : (indirect string, offset: 0x6200c): HAL_DMA_QUEUE_STATE_READY
    <f5e>   DW_AT_const_value : 1
 <2><f5f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <f60>   DW_AT_name        : (indirect string, offset: 0xe0e0c): HAL_DMA_QUEUE_STATE_BUSY
    <f64>   DW_AT_const_value : 2
 <2><f65>: Abbrev Number: 0
 <1><f66>: Abbrev Number: 3 (DW_TAG_typedef)
    <f67>   DW_AT_name        : (indirect string, offset: 0xa0842): HAL_DMA_QStateTypeDef
    <f6b>   DW_AT_decl_file   : 10
    <f6c>   DW_AT_decl_line   : 128
    <f6d>   DW_AT_decl_column : 3
    <f6e>   DW_AT_type        : <0xf47>
 <1><f72>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <f73>   DW_AT_type        : <0xf66>
 <1><f77>: Abbrev Number: 8 (DW_TAG_structure_type)
    <f78>   DW_AT_byte_size   : 36
    <f79>   DW_AT_decl_file   : 10
    <f7a>   DW_AT_decl_line   : 160
    <f7b>   DW_AT_decl_column : 9
    <f7b>   DW_AT_sibling     : <0xf9a>
 <2><f7f>: Abbrev Number: 2 (DW_TAG_member)
    <f80>   DW_AT_name        : (indirect string, offset: 0xc7b33): LinkRegisters
    <f84>   DW_AT_decl_file   : 10
    <f85>   DW_AT_decl_line   : 162
    <f86>   DW_AT_decl_column : 12
    <f87>   DW_AT_type        : <0xdd>
    <f8b>   DW_AT_data_member_location: 0
 <2><f8c>: Abbrev Number: 2 (DW_TAG_member)
    <f8d>   DW_AT_name        : (indirect string, offset: 0x15dce5): NodeInfo
    <f91>   DW_AT_decl_file   : 10
    <f92>   DW_AT_decl_line   : 163
    <f93>   DW_AT_decl_column : 12
    <f94>   DW_AT_type        : <0xa0>
    <f98>   DW_AT_data_member_location: 32
 <2><f99>: Abbrev Number: 0
 <1><f9a>: Abbrev Number: 3 (DW_TAG_typedef)
    <f9b>   DW_AT_name        : (indirect string, offset: 0x5dedd): DMA_NodeTypeDef
    <f9f>   DW_AT_decl_file   : 10
    <fa0>   DW_AT_decl_line   : 165
    <fa1>   DW_AT_decl_column : 3
    <fa2>   DW_AT_type        : <0xf77>
 <1><fa6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <fa7>   DW_AT_byte_size   : 4
    <fa7>   DW_AT_type        : <0xf9a>
 <1><fab>: Abbrev Number: 8 (DW_TAG_structure_type)
    <fac>   DW_AT_byte_size   : 16
    <fad>   DW_AT_decl_file   : 11
    <fae>   DW_AT_decl_line   : 49
    <faf>   DW_AT_decl_column : 9
    <faf>   DW_AT_sibling     : <0xfe8>
 <2><fb3>: Abbrev Number: 2 (DW_TAG_member)
    <fb4>   DW_AT_name        : (indirect string, offset: 0xda1a1): Ratio
    <fb8>   DW_AT_decl_file   : 11
    <fb9>   DW_AT_decl_line   : 51
    <fba>   DW_AT_decl_column : 12
    <fbb>   DW_AT_type        : <0xa0>
    <fbf>   DW_AT_data_member_location: 0
 <2><fc0>: Abbrev Number: 2 (DW_TAG_member)
    <fc1>   DW_AT_name        : (indirect string, offset: 0x5b096): RightBitShift
    <fc5>   DW_AT_decl_file   : 11
    <fc6>   DW_AT_decl_line   : 57
    <fc7>   DW_AT_decl_column : 12
    <fc8>   DW_AT_type        : <0xa0>
    <fcc>   DW_AT_data_member_location: 4
 <2><fcd>: Abbrev Number: 2 (DW_TAG_member)
    <fce>   DW_AT_name        : (indirect string, offset: 0x692ef): TriggeredMode
    <fd2>   DW_AT_decl_file   : 11
    <fd3>   DW_AT_decl_line   : 60
    <fd4>   DW_AT_decl_column : 12
    <fd5>   DW_AT_type        : <0xa0>
    <fd9>   DW_AT_data_member_location: 8
 <2><fda>: Abbrev Number: 2 (DW_TAG_member)
    <fdb>   DW_AT_name        : (indirect string, offset: 0xf7335): OversamplingStopReset
    <fdf>   DW_AT_decl_file   : 11
    <fe0>   DW_AT_decl_line   : 63
    <fe1>   DW_AT_decl_column : 12
    <fe2>   DW_AT_type        : <0xa0>
    <fe6>   DW_AT_data_member_location: 12
 <2><fe7>: Abbrev Number: 0
 <1><fe8>: Abbrev Number: 3 (DW_TAG_typedef)
    <fe9>   DW_AT_name        : (indirect string, offset: 0x82a82): ADC_OversamplingTypeDef
    <fed>   DW_AT_decl_file   : 11
    <fee>   DW_AT_decl_line   : 73
    <fef>   DW_AT_decl_column : 3
    <ff0>   DW_AT_type        : <0xfab>
 <1><ff4>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ff5>   DW_AT_byte_size   : 108
    <ff6>   DW_AT_decl_file   : 11
    <ff7>   DW_AT_decl_line   : 94
    <ff8>   DW_AT_decl_column : 9
    <ff8>   DW_AT_sibling     : <0x113e>
 <2><ffc>: Abbrev Number: 2 (DW_TAG_member)
    <ffd>   DW_AT_name        : (indirect string, offset: 0x7fdeb): ClockPrescaler
    <1001>   DW_AT_decl_file   : 11
    <1002>   DW_AT_decl_line   : 96
    <1003>   DW_AT_decl_column : 12
    <1004>   DW_AT_type        : <0xa0>
    <1008>   DW_AT_data_member_location: 0
 <2><1009>: Abbrev Number: 2 (DW_TAG_member)
    <100a>   DW_AT_name        : (indirect string, offset: 0x15ce2b): Resolution
    <100e>   DW_AT_decl_file   : 11
    <100f>   DW_AT_decl_line   : 114
    <1010>   DW_AT_decl_column : 12
    <1011>   DW_AT_type        : <0xa0>
    <1015>   DW_AT_data_member_location: 4
 <2><1016>: Abbrev Number: 2 (DW_TAG_member)
    <1017>   DW_AT_name        : (indirect string, offset: 0x15c62f): GainCompensation
    <101b>   DW_AT_decl_file   : 11
    <101c>   DW_AT_decl_line   : 117
    <101d>   DW_AT_decl_column : 12
    <101e>   DW_AT_type        : <0xa0>
    <1022>   DW_AT_data_member_location: 8
 <2><1023>: Abbrev Number: 2 (DW_TAG_member)
    <1024>   DW_AT_name        : (indirect string, offset: 0xd4ac2): ScanConvMode
    <1028>   DW_AT_decl_file   : 11
    <1029>   DW_AT_decl_line   : 128
    <102a>   DW_AT_decl_column : 12
    <102b>   DW_AT_type        : <0xa0>
    <102f>   DW_AT_data_member_location: 12
 <2><1030>: Abbrev Number: 2 (DW_TAG_member)
    <1031>   DW_AT_name        : (indirect string, offset: 0x123ed4): DataAlign
    <1035>   DW_AT_decl_file   : 11
    <1036>   DW_AT_decl_line   : 159
    <1037>   DW_AT_decl_column : 12
    <1038>   DW_AT_type        : <0xa0>
    <103c>   DW_AT_data_member_location: 16
 <2><103d>: Abbrev Number: 2 (DW_TAG_member)
    <103e>   DW_AT_name        : (indirect string, offset: 0x43a31): EOCSelection
    <1042>   DW_AT_decl_file   : 11
    <1043>   DW_AT_decl_line   : 163
    <1044>   DW_AT_decl_column : 12
    <1045>   DW_AT_type        : <0xa0>
    <1049>   DW_AT_data_member_location: 20
 <2><104a>: Abbrev Number: 2 (DW_TAG_member)
    <104b>   DW_AT_name        : (indirect string, offset: 0x106782): LowPowerAutoWait
    <104f>   DW_AT_decl_file   : 11
    <1050>   DW_AT_decl_line   : 167
    <1051>   DW_AT_decl_column : 19
    <1052>   DW_AT_type        : <0x903>
    <1056>   DW_AT_data_member_location: 24
 <2><1057>: Abbrev Number: 2 (DW_TAG_member)
    <1058>   DW_AT_name        : (indirect string, offset: 0x1a08b): LowPowerAutoPowerOff
    <105c>   DW_AT_decl_file   : 11
    <105d>   DW_AT_decl_line   : 188
    <105e>   DW_AT_decl_column : 12
    <105f>   DW_AT_type        : <0xa0>
    <1063>   DW_AT_data_member_location: 28
 <2><1064>: Abbrev Number: 2 (DW_TAG_member)
    <1065>   DW_AT_name        : (indirect string, offset: 0xbb5f6): ContinuousConvMode
    <1069>   DW_AT_decl_file   : 11
    <106a>   DW_AT_decl_line   : 196
    <106b>   DW_AT_decl_column : 19
    <106c>   DW_AT_type        : <0x903>
    <1070>   DW_AT_data_member_location: 32
 <2><1071>: Abbrev Number: 2 (DW_TAG_member)
    <1072>   DW_AT_name        : (indirect string, offset: 0x49bcf): NbrOfConversion
    <1076>   DW_AT_decl_file   : 11
    <1077>   DW_AT_decl_line   : 201
    <1078>   DW_AT_decl_column : 12
    <1079>   DW_AT_type        : <0xa0>
    <107d>   DW_AT_data_member_location: 36
 <2><107e>: Abbrev Number: 2 (DW_TAG_member)
    <107f>   DW_AT_name        : (indirect string, offset: 0x31749): DiscontinuousConvMode
    <1083>   DW_AT_decl_file   : 11
    <1084>   DW_AT_decl_line   : 225
    <1085>   DW_AT_decl_column : 19
    <1086>   DW_AT_type        : <0x903>
    <108a>   DW_AT_data_member_location: 40
 <2><108b>: Abbrev Number: 2 (DW_TAG_member)
    <108c>   DW_AT_name        : (indirect string, offset: 0x10ca2c): NbrOfDiscConversion
    <1090>   DW_AT_decl_file   : 11
    <1091>   DW_AT_decl_line   : 235
    <1092>   DW_AT_decl_column : 12
    <1093>   DW_AT_type        : <0xa0>
    <1097>   DW_AT_data_member_location: 44
 <2><1098>: Abbrev Number: 2 (DW_TAG_member)
    <1099>   DW_AT_name        : (indirect string, offset: 0x119291): ExternalTrigConv
    <109d>   DW_AT_decl_file   : 11
    <109e>   DW_AT_decl_line   : 240
    <109f>   DW_AT_decl_column : 12
    <10a0>   DW_AT_type        : <0xa0>
    <10a4>   DW_AT_data_member_location: 48
 <2><10a5>: Abbrev Number: 2 (DW_TAG_member)
    <10a6>   DW_AT_name        : (indirect string, offset: 0x63b95): ExternalTrigConvEdge
    <10aa>   DW_AT_decl_file   : 11
    <10ab>   DW_AT_decl_line   : 247
    <10ac>   DW_AT_decl_column : 12
    <10ad>   DW_AT_type        : <0xa0>
    <10b1>   DW_AT_data_member_location: 52
 <2><10b2>: Abbrev Number: 2 (DW_TAG_member)
    <10b3>   DW_AT_name        : (indirect string, offset: 0x3a088): ConversionDataManagement
    <10b7>   DW_AT_decl_file   : 11
    <10b8>   DW_AT_decl_line   : 252
    <10b9>   DW_AT_decl_column : 12
    <10ba>   DW_AT_type        : <0xa0>
    <10be>   DW_AT_data_member_location: 56
 <2><10bf>: Abbrev Number: 1 (DW_TAG_member)
    <10c0>   DW_AT_name        : (indirect string, offset: 0x1dbcf): DMAContinuousRequests
    <10c4>   DW_AT_decl_file   : 11
    <10c5>   DW_AT_decl_line   : 263
    <10c7>   DW_AT_decl_column : 19
    <10c8>   DW_AT_type        : <0x903>
    <10cc>   DW_AT_data_member_location: 60
 <2><10cd>: Abbrev Number: 1 (DW_TAG_member)
    <10ce>   DW_AT_name        : (indirect string, offset: 0x1480e1): Overrun
    <10d2>   DW_AT_decl_file   : 11
    <10d3>   DW_AT_decl_line   : 271
